{
    "version": "https://jsonfeed.org/version/1",
    "title": "Jeff James",
    "description": "Reader, writer, grower of artisanal beards",
    "home_page_url": "https://unsquare.com/",
    "feed_url": "https://unsquare.com/feed.json",
    "icon": "https://unsquare.com/images/JeffJames.jpg",
    "author": {
        "name": "Jeff James",
        "url": "https://unsquare.com",
        "avatar": "https://unsquare.com/images/JeffJames.jpg"
    },
    "expired": false,
    "items": [

        {
            "id": "/blog/dancing-with-an-american-in-paris",
            "title": "Dancing With An American in Paris",
            "content_html": "<p>The dancing in <a href=\"https://www.imdb.com/title/tt0043278/\">An American in Paris</a> is gorgeous. We saw it at the <a href=\"https://www.hollywoodbowl\">Hollywood Bowl</a> with the <a href=\"https://www.laphil.com\">LA Philharmonic</a> playing the score, and we were lucky to have pretty great seats dead center. If you come away with nothing from this movie but the dancing and, to a lesser degree, the singing, then I think you’ll have a wonderful time. If you pay any attention to the story, however, you’ll probably raise a few eyebrows. The woman sitting behind me kept hmmm-ing at all of the many problematic elements.</p>\n\n<p>While Gene Kelly’s character, Jerry, is out on a sort-of date with Milo, a woman who can help him with his painting career, he becomes infatuated with Lise, a nineteen-year-old who happens to be dating a friend of his (we know this, but he doesn’t find out until much later). Milo, who is age-appropriate and still more than a decade younger than Kelly in real life, is somehow styled to seem like a pretty but slightly dowdy older woman. Jerry blatantly ignores Milo and harasses a reluctant Lise into dancing with him and eventually comes away with her phone number despite her trying to give him a fake number.</p>\n\n<p>Later, Jerry calls Lise (at work, because I guess she didn’t have a phone at home) and she tells him not to call her again, so what does he do? He goes to her work and harasses her more until she finally agrees to go on a date with him. Not out of pity, mind you, but because he did something silly and made her laugh and suddenly he’s okay.</p>\n\n<p>Through all this, Lise is still dating Jerry’s friend Henri, who is a perfect gentleman as well as a professional singer. He never does anything terrible to her and in fact she seems to really like him, but she later admits that she isn’t in love with him because she’s fallen in love with Jerry.</p>\n\n<p>So, to recap, Jerry is a pushy dickhead of a guy who goes to stalkerish lengths to “get the girl” and the girl in question isn’t really in a love triangle, she’s just cheating on her boyfriend (but they are in France so I guess it’s just what you do). Also there is a two decade age difference between Jerry and Lise and Leslie Caron looks every bit of her nineteen years.</p>\n\n<p>Thank god for the dancing!</p>\n\n<p><em>A version of this review was originally posted at <a href=\"https://letterboxd.com/unsquare/film/an-american-in-paris/\">Letterboxd</a>.</em></p>\n\n",
			"image": "https://unsquare.com/images/american-bw-feature.jpg",
            "url": "https://unsquare.com/blog/dancing-with-an-american-in-paris/",
            "date_published": "2019-09-15 00:00:00 -0700"
        },

        {
            "id": "/blog/new-ipad-new-impressions",
            "title": "New iPad, New Impressions",
            "content_html": "<p>I recently bought a new iPad, my third so far. My first was an iPad 2 bought all the way back in 2012, when I still worked for Apple. I remember liking it but not using it as much as I thought I would. My second iPad was a 2017 model that became my primary reading device, easily overtaking my Kindle. My new iPad is an <a href=\"https://www.apple.com/shop/buy-ipad/ipad-pro/11-inch-display-256gb-space-gray-wifi\">11 inch Pro model</a>, by far the beefiest iPad I've ever owned, and the only one with more than 32gb of storage.</p>\n\n<p>Storage was one of the main reasons I decided to buy a new iPad. I kept running out of space on the 2017 iPad, which tended to move all of my apps to the cloud every time I put it to sleep. I splurged for 256gb on the new one, and downloaded a bunch of HD comics from <a href=\"https://comixology.com\">ComiXology</a> as soon as I set it up. I could probably fill the space with nothing but unread comics from my collection.</p>\n\n<p>I also bought it because I'd saved up a bunch of Amazon Prime rewards points and they were burning a hole in my pocket. I've had the card for years, long before Amazon bought Whole Foods, but I've never built up points as fast as I did after it started offering a 5% return on all Whole Foods purchases. We shop there at least once a week, if not more, so I built up hundreds of rewards dollars in no time flat.</p>\n\n<p>Along with the iPad, I bought a <a href=\"https://www.moshi.com/en/product/versacover-for-ipad-pro-11-inch/stone-gray?device=345\">Moshi Versacover</a> case. I chose it instead of the standard Apple Smart Cover because it has a clear plastic back for more protection and because you can fold it to support several different viewing angles. At first, I wasn't sure if I liked the cover because the instructions that came with it were so minimal as to be unhelpful, and I couldn't figure out how to fold it to get the right angles. However, after a few days of playing with it, I finally figured it out and I think it's pretty great.</p>\n\n<p>For example, I went to Starbucks and propped up my iPad in portrait mode while I read a comic. The reading angle was perfect, and the iPad Pro screen is big enough that I could view an entire page without needing to zoom in on a panel. I couldn't have done that with an Apple cover, and the 9.7” screen on a standard iPad is just small enough that reading a full page doesn't work.</p>\n\n<p>I did originally think about getting the Smart Keyboard Folio cover, but when I learned that the keyboard faces out when you fold it back, I knew it wouldn't work for me. The main way I use my iPad is holding it in portrait mode, for reading, writing, or browsing the web. I do a lot of writing while holding my iPad in bed, so I knew that I could forgo a physical keyboard.</p>\n\n<p>I will say that the iPad Pro is just heavy enough that it is a little awkward to hold for long periods of time, but the Moshi cover helps make up for that. I can prop it on my stomach while lying down and it works great for reading or browsing. That angle doesn't work for writing, though. Still, if I'm sitting at a desk, typing on the screen isn't bad at all, and I do have an unused Bluetooth keyboard in the closet that I could pull out. I may not ever buy a keyboard case for it.</p>\n\n<p>I don't know if I will ever replace my MacBook with an iPad as my only computer, but the prospect has never seemed so appealing.</p>\n\n",
			"image": "https://unsquare.com/images/ipad-feature.jpg",
            "url": "https://unsquare.com/blog/new-ipad-new-impressions/",
            "date_published": "2019-09-07 12:14:42 -0700"
        },

        {
            "id": "/blog/get-shorty-is-my-new-favorite-show",
            "title": "Get Shorty is My New Favorite Show",
            "content_html": "<p>Recommending new TV shows to your friends is a social faux pas at this point. Everyone already has plenty of shows to watch, and who are you to insist they give up even more of their precious time?</p>\n\n<p>It doesn't help when it's a show like <a href=\"https://www.epix.com/series/get-shorty\">Get Shorty</a>, which airs on EPIX, the premium movie channel that nobody has heard of even if they already have it. <s>I can't just tell you to add it to your Netflix watchlist so that you can feel guilty about not watching it for the next five years; I have to somehow convince you to either pay for EPIX or buy the first season on iTunes. I did the latter, and if EPIX had a stand-alone app, I'd probably already have a subscription.</s> UPDATE: Get Shorty season one is <a href=\"https://www.netflix.com/title/80175945\">now available on Netflix</a>, so GET ON THAT!</p>\n\n<p>That's all a roundabout way of saying that Get Shorty is one of the few shows I want to recommend to people. <a href=\"https://www.nbc.com/the-good-place\">The Good Place</a> was the last show I could recommend without reservations, and if Get Shorty was available on any popular streaming service, I'd be shouting it to the rooftops. Instead, I just have to describe it to people and hope that they bite.</p>\n\n<p>Why do I like the show so much? One explanation is that I'm predisposed to like it because Elmore Leonard is one of my favorite authors. This came about in high school because I watched the one-two punch of <a href=\"https://www.imdb.com/title/tt0113161/?ref_=nv_sr_2\">Get Shorty</a> and <a href=\"https://www.imdb.com/title/tt0120780/?ref_=nv_sr_1\">Out of Sight</a> in theaters and wanted to find out where my favorite filmmakers got their inspiration. I spent the next few years checking out his work, but I didn't read my favorite of his books, <a href=\"https://www.goodreads.com/book/show/288992.Bandits\">Bandits</a>, until more recently.</p>\n\n<p>That could go the other way, too; Get Shorty was one of my favorite movies when I was at an impressionable age, and it's likely that a new adaptation could never live up to the original. Fortunately, this version of Get Shorty takes its cues from Fargo on FX and only follows the loosest outlines of the original story.</p>\n\n<p>Instead of including a poor imitation of Travolta's career-best performance as the eternally cool Chili Palmer, the show invents a whole new cast of characters, with <a href=\"https://www.imdb.com/name/nm1483369/?ref_=tt_cl_t3\">Chris O'Dowd</a> taking the lead as Miles Daly, who we first meet disposing of bodies with his partner, Louis.</p>\n\n<p>Where Chili was a chill, genial presence, and only threatened obvious bad guys with a punch to the nose or some rough-housing, Miles doesn't bat an eye at murder and dismemberment, and oftentimes seems right on the edge of flipping out. It's kind of amazing watching O'Dowd, who usually plays more laconic characters like Roy from <a href=\"https://www.imdb.com/title/tt0487831/?ref_=nm_flmg_act_22\">The IT Crowd</a>, play someone so undeniably dangerous.</p>\n\n<p><a href=\"https://www.imdb.com/name/nm0005380/?ref_=tt_cl_t4\">Ray Romano</a> plays low-rent movie producer Rick Moreweather, and I've never liked him more. Everybody Loves Raymond made me want to grind my teeth, but Romano has done some amazing, nuanced work since then. His facial expressions here are a master class in acting, letting you see each individual thought go through his character's head as he realizes what horrible new mistake he's just made.</p>\n\n<p>The show surrounds them with a murderer's row of fascinating characters, which is definitely a signature of Leonard's work. One of the benefits of television is that those characters get so much more time to breathe and develop. <a href=\"https://www.imdb.com/name/nm0108703/?ref_=tt_cl_t5\">Sean Bridgers</a> is especially good as Miles' partner, Louis, a Mormon who doesn't believe in premarital sex, but who has no problem killing people when they become inconvenient or annoying.</p>\n\n<p>The show is hilarious, but it also feels darker than the movie or the book. The Travolta movie was pretty close to the book, from what I remember; they both have a breezy, satirical tone, and nothing truly horrible happens. The TV version is a satire, but it's also a pitch-black comedy, willing to let its protagonist do much more terrible things that you could include in a 1990s star vehicle. Maybe it's just par for the course with modern prestige television.</p>\n\n<p>The second season just started airing on EPIX, and I'm tempted to add the channel to my cable package (which I only keep because it's cheaper than paying for internet by itself,) but I may wait a month or two until it finishes airing so that we can binge it. Now I just have to convince more people to watch it so that it keeps getting renewed.</p>\n\n",
			"image": "https://unsquare.com/images/get-shorty-feature.jpg",
            "url": "https://unsquare.com/blog/get-shorty-is-my-new-favorite-show/",
            "date_published": "2018-08-20 00:00:00 -0700"
        },

        {
            "id": "/blog/where-im-at-right-now",
            "title": "Where I'm at Right Now",
            "content_html": "<p>I've had a tough year so far.</p>\n\n<p>When I last checked in on my writing goals back in December, I talked about how the US election did a number on my motivation and ability to focus.</p>\n\n<p>I sort of recovered from the post-election blues in January and February of this year… but then my cat, Jackson, got very sick. I ultimately had to put him to sleep on March 16th.</p>\n\n<p>Jackson was sick for a while - since at least the middle of 2016 - but he took a turn in February and went downhill very fast. The whole thing was incredibly stressful and absolutely devastating, even though I knew on an intellectual level that my cats were reaching the age where health problems could be a concern.</p>\n\n<p>Needless to say, I was pretty much useless while he was sick and after he died.</p>\n\n<p>At the moment, I'm doing okay. I miss him a little bit every day, but I'm not a weepy mess. I did completely lose it when the vet's office sent me a card with his paw-prints on it, but other than that I'm on a fairly even keel.</p>\n\n<p>I've slowly managed to get back into writing now and then, but I haven't come anywhere close to a regular daily habit for a while now.</p>\n\n<p>It doesn't help that April is a busy month. We were out of town the first two weekends (first to Palm Springs, then to Denver for a wedding), and then this past weekend we hosted game night on Saturday and went to an Easter potluck. Next weekend my parents are coming to town.</p>\n\n<p>Needless to say, I haven't had much downtime to sit down and focus on writing. Weeknights are almost always a bust on a good day, but I've been extra tired thanks to those busy weekends.</p>\n\n<p>That said, I am <em>ever-so-close</em> to finishing a project I've been working on for a very long time now. I've got an outline and about a third of the actual writing done, and I've been picking at it whenever I have a spare moment. I probably won't manage to finish it this month, but the end is in sight.</p>\n\n<p>Once I finish that, I'd like to start work on something completely new. I'm tempted to take another crack at my long-gestating short story from last year, but it feels like I need to diversify.</p>\n\n<p>I spent 2016 working on the same two projects without much forward momentum, and it was a bit of a drag. I feel like I don't have anything concrete to show for all of that effort. If I'd been more prolific, it might not feel like such a waste of time.</p>\n",
			"image": "https://unsquare.com/images/jackson-feature.jpg",
            "url": "https://unsquare.com/blog/where-im-at-right-now/",
            "date_published": "2017-04-18 00:00:00 -0700"
        },

        {
            "id": "/blog/the-current-state-of-my-writing-goals",
            "title": "The Current State of my Writing Goals",
            "content_html": "<p>Well, I had a good run while it lasted. I managed to write almost every day for more than half a year. No matter how you look at it, that's a major accomplishment, especially compared to every other time I've tried to write every day.</p>\n\n<p>I started missing days in the middle of the summer - first because we went on vacation, and then later for less compelling reasons - but I didn't completely blow it until November.</p>\n\n<p>First, however, I spent most of October working on a script. It was hard work, and I wrote a lot of pages in a fairly short amount of time. I delivered my draft at the end of the month, but I haven't gone back to it since.</p>\n\n<p>I fully intended to keep working on the script, but I lost momentum and haven't quite managed to get it back yet. The election was a big part of the problem. After the results came in, it was hard to focus on anything but the unrelenting horror, and I didn't really feel like trying to write for a good long time.</p>\n\n<p>In the end, I only wrote a handful of days in November. The most substantial thing I wrote was a book review. Before long, I decided that my writing goal was done for the year and I didn't really try too hard to get back into it.</p>\n\n<p>That said, I am hoping I can finish a rewrite of my script before the end of the year along with drafts of two more scripts. I'd like to get that work off my plate so that I can start fresh next year.</p>\n\n<p>I also still have my short story knocking around. Somehow I spent most of the year working on that damn story. I submitted it three times since I last posted - twice in August, and once in October - and the last place offered feedback, which was crucial. Unfortunately, addressing their notes will require gutting and re-working the whole thing yet another time.</p>\n\n<p>I definitely don't want to abandon it after all of that work, but it's starting to feel like a bit of an albatross. I want to feel like it's finished so that I can move on to something new, but I don't want to re-submit without addressing that feedback. I think for now I'm going to let it lay fallow until I finish those scripts.</p>\n\n<p>As for next year, I've decided to track journaling separately from other non-fiction. I want to get a better idea of how many days I used the \"escape hatch\" instead of working on something more substantial.</p>\n\n<p>I'm definitely going to rededicate myself to my goal, however. I think it was really positive in a lot of ways, even if it was occasionally frustrating or demoralizing. Maybe next year I can break this year's record.</p>\n\n<p>For now, I'm going to do what I can to be productive before the holidays, but I'm not going to beat myself up if I don't finish my projects in the time I have left this year.</p>\n\n<p><strong>Final counts for August 2016:</strong></p>\n\n<ul>\n  <li>6 hours of related work</li>\n  <li>0 script pages</li>\n  <li>2450 words of fiction</li>\n  <li>4421 words of non-fiction</li>\n  <li>6871 total words</li>\n</ul>\n\n<p><strong>Final counts for September 2016:</strong></p>\n\n<ul>\n  <li>7.5 hours of related work</li>\n  <li>0 script pages</li>\n  <li>0 words of fiction</li>\n  <li>3334 words of non-fiction</li>\n  <li>3334 total words</li>\n</ul>\n\n<p><strong>Final counts for October 2016:</strong></p>\n\n<ul>\n  <li>0.5 hours of related work</li>\n  <li>52 script pages</li>\n  <li>0 words of fiction</li>\n  <li>1853 words of non-fiction</li>\n  <li>1853 total words</li>\n</ul>\n\n<p><strong>Final counts for November 2016:</strong></p>\n\n<ul>\n  <li>1 hour of related work</li>\n  <li>0 script pages</li>\n  <li>300 words of fiction</li>\n  <li>1300 words of non-fiction</li>\n  <li>1600 total words</li>\n</ul>\n",
			"image": "https://unsquare.com/images/paperhead-feature.jpg",
            "url": "https://unsquare.com/blog/the-current-state-of-my-writing-goals/",
            "date_published": "2016-12-05 00:00:00 -0800"
        },

        {
            "id": "/blog/june-and-july-by-the-numbers",
            "title": "June and July By the Numbers",
            "content_html": "<p>If you thought my last post in this series was belated, this one takes the cake!</p>\n\n<p>I just barely stuck to my writing goals in June and July. I had more than one day where I seriously considered throwing in the towel and calling the whole thing off, but I still managed to soldier on (for the most part)</p>\n\n<p>We went to Palm Springs in the middle of June, right after Amy's job ended. I gave myself permission to skip writing for those days since it was a vacation. I knew I'd have a hard time getting anything done after hanging out poolside all day, and I wasn't wrong.</p>\n\n<p>I also gave myself the day off when we went to Santa Barbara in July for Amy's job interview at UCSB. I drove both ways, and our day in town on Saturday was pretty jam-packed. I was completely exhausted by the time we got home, so I definitely needed another day off.</p>\n\n<p>However, I did finally miss a day of writing on July 24th. I was so exhausted that I didn't even have the energy to write a journal entry. I could have declared that the end of my writing streak, but when I thought about it, I realized that the most important thing was that I at least <em>try</em> to write every day.</p>\n\n<p>If I reach the end of the year and I managed to write on all but a handful of days, I would still consider that a huge win. With that in mind, I decided to add a new rule to my daily goal to help me keep things going: if I miss a day, it doesn't count as long as I work on one of my projects the next day.</p>\n\n<p>I can't count a journal entry or a blog post as my makeup writing, but if I write fiction, scripts pages or do some outlining, I'm good to go. That way I can still recover even if I miss a single day. If I miss two days in a row and it isn't a vacation, that's when I'll need to restart my writing streak.</p>\n\n<p>In between journal entries, I did do a little bit of productive work these past two months. I spend a good amount of time brainstorming and outlining for an ongoing project. I also finally managed to resubmit my story at the end of July. I think I'm finally happy with the state of my story, so I don't plan on rewriting it if I end up submitting again.</p>\n\n<p>I've made a lot of positive steps these last two months, but I still beat myself up when it feels like I've done nothing but write journal entries for weeks. Maybe I should try to do more writing exercises so that I won't have to resort to journal entries. The main issue is, as always, finding the time to write.</p>\n\n<p><strong>Final counts for June 2016:</strong></p>\n\n<ul>\n  <li>18.5 hours of related work</li>\n  <li>0 script pages</li>\n  <li>74 words of fiction</li>\n  <li>4347 words of non-fiction</li>\n  <li>4421 total words</li>\n</ul>\n\n<p><strong>Final counts for July 2016:</strong></p>\n\n<ul>\n  <li>17 hours of related work</li>\n  <li>0 script pages</li>\n  <li>378 words of fiction</li>\n  <li>4434 words of non-fiction</li>\n  <li>4812 total words</li>\n</ul>\n\n<p><strong>These were my goals for June:</strong></p>\n\n<ol>\n  <li>Ideally I want to finish the outline for my current project, but we're already halfway through the month as I write this, so it might be a tall order.</li>\n  <li>I'd like to write a blog post for Full of Words that isn't another book review. It's been a while since I've written one of those.</li>\n  <li>Spend some time researching or brainstorming for Hops Arcana.</li>\n</ol>\n\n<p><strong>Here's how those goals played out:</strong></p>\n\n<ol>\n  <li>I'm really damn close on this. I just need one more brainstorming session and then I should be able to knock out the final part of the outline.</li>\n  <li>I did write two book reviews in July, but I didn't manage to write anything else for Full of Words. Maybe this month?</li>\n  <li>I haven't looked at Hops Arcana since my screenwriting class ended.</li>\n</ol>\n\n<p><strong>Here are my goals for August:</strong></p>\n\n<ol>\n  <li>Have one final brainstorming session for my ongoing project, then finish my outline and start writing. Ideally, finish a first draft by the end of August.</li>\n  <li>Write at least three posts for Full of Words - reviews or otherwise.</li>\n  <li>Finish a rough draft of a new short story.</li>\n</ol>\n",
			"image": "https://unsquare.com/images/typewriter-bw-feature.jpg",
            "url": "https://unsquare.com/blog/june-and-july-by-the-numbers/",
            "date_published": "2016-08-06 00:00:00 -0700"
        },

        {
            "id": "/blog/belated-may-by-the-numbers",
            "title": "(A Belated) May by the Numbers",
            "content_html": "<p>Well, here it is, halfway through the month of June, and I'm just now getting around to posting about my writing progress for May. That tells you a lot about what kind of month it was, and how my writing is going in general.</p>\n\n<p>The most significant thing I did last month was re-submit <em>Ghost of a Friend</em> after it was rejected several times. I ended up rewriting it a little bit every time I submitted, which got a little nerve-wracking after a certain point. I started worrying that my changes weren't actually improving the story.</p>\n\n<p>Before I submitted that last time, I cut around 800 words. The story was starting to feel a little bloated, so I decided that cuts were in order. I also discovered that there aren't many markets willing to accept a story longer than 5000 words. I didn't manage to get it under 4000 words like I'd hoped, but I did cut out a few superfluous scenes.</p>\n\n<p>I received my fourth rejection a few days ago, but I haven't gotten around to resubmitting yet. It's definitely a bit demoralizing, sending your work out into the world only to get back nothing but rejections. That said, I don't know if I'm quite ready to send it to somewhere a bit less challenging. I'd like to keep shooting for the stars.</p>\n\n<p>However, it turns out that the best way to keep myself from obsessively rewriting is to submit the story to a slow-moving market. I'm planning on tweaking a few small things before I submit again, but I'll probably pick another slow market. It was kind of a relief to be able to put the story out of my mind for a few weeks while I waited for a response.</p>\n\n<p>As for the rest of my time last month, there were a lot of days where I wrote in my journal as a last resort. That's probably why it feels like I didn't do enough. I didn't make any inroads on another short story, but I did write a handful of blog posts.</p>\n\n<p>The biggest bright spot came near the end of the month when I had a very productive brainstorming session for another project. Hopefully it won't be too much longer before I can dig in and start writing.</p>\n\n<p><strong>My final counts for May 2016 were:</strong></p>\n\n<ul>\n  <li>14 hours of related work</li>\n  <li>1 script page</li>\n  <li>565 words of fiction</li>\n  <li>6548 words of non-fiction</li>\n  <li>7113 total words</li>\n</ul>\n\n<p>Definitely an anemic showing for new fiction, but that's probably because I spent so much time deleting words from my story. I wrote a bit more non-fiction during the month, but it was mostly journal entries rather than blog posts.</p>\n\n<p>Overall not a terrible word count, and I did finally spend a little bit of time working on a script, so I'll count that in the win column.</p>\n\n<p><strong>These were my goals for May:</strong></p>\n\n<ol>\n  <li>Start something new, whether it's a short story or a script for a new web series.</li>\n  <li>Spend some time working on the outline for my screenplay. Don't let it lay fallow for too long.</li>\n  <li>Don't leave writing until the end of the day. Write more before work or during my lunch break. Take time to write at the library or a coffee shop.</li>\n</ol>\n\n<p><strong>Here's how those goals played out:</strong></p>\n\n<ol>\n  <li>Nope. No luck here.</li>\n  <li>Hops Arcana isn't getting much love in these parts, but I did spend some serious time brainstorming for another project.</li>\n  <li>Man, I <em>struggle</em> with this one. I'm never awake enough to write first thing in the morning, I never feel like writing on my breaks at work, and I'm tired in the evenings. It's a no-win scenario. The good news is that I'm on such a streak these days that the momentum forces me to at least write <em>something</em> before I go to sleep at night.</li>\n</ol>\n\n<p><strong>Here are my goals for June:</strong></p>\n\n<ol>\n  <li>Ideally I want to finish the outline for my current project, but we're already halfway through the month as I write this, so it might be a tall order.</li>\n  <li>I'd like to write a blog post for Full of Words that isn't another book review. It's been a while since I've written one of those.</li>\n  <li>Spend some time researching or brainstorming for Hops Arcana.</li>\n</ol>\n",
			"image": "https://unsquare.com/images/vintage-typewriter-feature.jpg",
            "url": "https://unsquare.com/blog/belated-may-by-the-numbers/",
            "date_published": "2016-06-14 00:00:00 -0700"
        },

        {
            "id": "/blog/playing-the-submission-game",
            "title": "Playing the Submission Game",
            "content_html": "<p>As of this writing, I've submitted <em>Ghost of a Friend</em> to three markets and received three rejections, each one quicker than the last.</p>\n\n<p>After I received a rejection from <a href=\"http://firesidefiction.com\">Fireside</a>, I looked for other places to submit, prioritizing markets that paid a pro rate (more than 5 cents a word) and had a quick average response time.</p>\n\n<p>I definitely don't want to submit somewhere that would keep it for months without responding. I also refuse to do any submissions by mail. The idea of mailing out a story feels like abandoning it to the mercies of a black hole.</p>\n\n<p>The three markets I've submitted to so far all have acceptance rates of <em>less than one percent</em> according to <a href=\"http://duotrope.com\">Duotrope</a>:</p>\n\n<ul>\n  <li>0.40% for Fireside</li>\n  <li>0.08% for <a href=\"http://clarkesworldmagazine.com\">Clarkesworld</a></li>\n  <li>0.08% for <a href=\"https://www.sfsite.com/fsf/\">Fantasy &amp; Science Fiction</a></li>\n</ul>\n\n<p>Those are some <em>pretty long odds</em>. Knowing that helped take away most of the sting of rejection, but after I heard back from Fantasy &amp; Science Fiction, I did wonder if I really was sending out the best possible version of my story.</p>\n\n<p>When I sent the story to Fireside, it was exactly 5000 words long - their maximum - but I felt like there were a few moments I cut short to stay under that limit. As soon as it was rejected, I added another 150 or so words to beef up those scenes. That's the version I sent to Clarkesworld and F&amp;SF.</p>\n\n<p>Problem is, I'm starting to think that <em>Ghost of a Friend</em> might be a little bloated at 5000+ words. I've looked through submission requirements for a lot of markets, and it seems like very few places accept stories that length. 4000 or 3000 word limits are very common.</p>\n\n<p>After my third draft, I swore that I wasn't going to do any more major revisions because I don't want to get stuck working on the same damn story forever. Putting all of my eggs into a single basket is not a great idea, especially because short stories aren't particularly lucrative on their own. Even still, it seems like I might be doing myself a disservice if I keep submitting this version of the story.</p>\n\n<p>My new goal is to get the story under 4000 words. I think I can tighten up the first few scenes and get to the good stuff much sooner.</p>\n\n<p>That means I'm going to hold off on submitting for a fourth time until I've made yet another pass. Hopefully it won't take too long to cut it down as much as possible.</p>\n\n<p>As an aside, I just re-read <em><a href=\"http://unsquare.com/portfolio/writing/burning-love/\">Burning Love</a></em> to try and remember how I managed to write and sell a short story four years ago on my very first attempt. The story definitely holds up, but I had completely forgotten that I named the main character Nate… which is also one of the names I used in <em>Ghost of a Friend</em>. I should probably change that, haha.</p>\n\n",
			"image": "https://unsquare.com/images/paper-ball-feature.jpg",
            "url": "https://unsquare.com/blog/playing-the-submission-game/",
            "date_published": "2016-05-21 00:00:00 -0700"
        },

        {
            "id": "/blog/april-by-the-numbers",
            "title": "April by the Numbers",
            "content_html": "<p>April was a good month for writing. I finally managed to buckle down and finish a third draft of <em>Ghost of a Friend</em>, and I did it with enough time left to submit to <a href=\"http://www.firesidefiction.com\">Fireside</a> during their open period. I worked on the newest draft in small chunks throughout April, writing 100 or 200 words here and there until I finished it in a rush of more than 1200 words at the end of the month.</p>\n\n<p>I've wanted to submit to Fireside ever since the magazine first launched a few years ago, so I'm glad the timing worked out. My submission was one of <strong>2,393 stories</strong> they received during the month of April, so the probability of my story getting accepted is pretty low (<a href=\"http://www.duotrope.com\">Duotrope</a> says they currently have a <strong>.51% acceptance rate</strong>!), but at least I made the effort.</p>\n\n<p>If my story is rejected, my plan is to submit it to all of the pro-level markets on Duotrope one by one starting with the quickest to respond. I've resolved to keep submitting <em>Ghost of a Friend</em> until it finds a home.</p>\n\n<p>I may tweak it a bit before I send it to another market, however. I had to cut a few words to come in under 5000 for Fireside, and I think the final conversation scene came out a little rushed as a result. That said, I don't think the story should be much longer than it currently is, so it might be best if I cut from scenes earlier in the story to make more room for that conversation.</p>\n\n<p>Now that I've submitted the story, I need to decide what I want to write next. Ideally I should have more than one piece ready for submission at all times, but I also want to work on my screenplay before I lose any more steam on that idea. As soon as I started focusing on other projects, the screenplay just sort of fell by the wayside.</p>\n\n<p>Right now the story idea that appeals to me the most is called <em>Drones: A Love Story</em>. I wrote a draft of <em>Drones</em> a few years ago when Amazon first announced their <a href=\"http://www.amazon.com/b?node=8037720011\">drone delivery program</a>. I finished it in a very short amount of time and then ultimately abandoned the story when I was unhappy with the results.</p>\n\n<p>I recently came up with a new approach to <em>Drones</em> that I think will fix a lot of the issues I had with the original draft. It'll be a page one rewrite, but the story feels fairly complete in my head, so it's just a matter of sitting down and knocking it out.</p>\n\n<p>I think the main thing I need to do in May is prioritize my time. It's likely I'll have to split my writing time between projects for myself and projects for others, so I'll have limited bandwidth for something completely new. Knowing that, I should probably try to get started on something soon so that I can have a few irons in the fire.</p>\n\n<p>I could technically still submit to the <a href=\"http://austinfilmfestival.com\">Austin Film Festival</a> if I get something ready by May 20th, but I think the only category I could pull off at this point is the <a href=\"https://austinfilmfestival.com/submit/digital/\">Scripted Digital Series</a>. That category allows for \"1-3 scripted episodes, totaling no more than 30 pages in length\", which is totally a doable amount of writing if I break out the stories really well. All I'd need to do is decide on a series concept.</p>\n\n<p><strong>My final counts for April 2016 were:</strong></p>\n\n<ul>\n  <li>13 hours of related work</li>\n  <li>0 script pages</li>\n  <li>3712 words of fiction</li>\n  <li>4146 words of non-fiction</li>\n  <li>7858 total words</li>\n</ul>\n\n<p>This is what I would consider a pretty good balance for an average month. My total word count was higher than last month, and the work was spread pretty evenly between categories. The only category that continues to get short shrift is script pages, but May might change that.</p>\n\n<p><strong>These were my goals for April:</strong></p>\n\n<ol>\n  <li>Finish my final rewrite of Ghost of a Friend and submit it to <em>at least one market</em> by the end of the month.</li>\n  <li>Create my outline board (i.e. draw lines on the board and lay out the sections) and outline <em>at least one sequence</em> of my screenplay.</li>\n  <li>Find more ways to get concrete wins that make me feel like I'm progressing as a writer.</li>\n</ol>\n\n<p><strong>Here's how those goals played out:</strong></p>\n\n<ol>\n  <li>I waited until pretty close to the last minute, but I ultimately nailed this goal. I finished my story and submitted it to Fireside on April 30th with half a day to spare.</li>\n  <li>I didn't touch anything related to my screenplay during the month of April, so I'll have to revisit this goal in May.</li>\n  <li>In retrospect, this goal was pretty vague. I think for my purposes, finishing my story counts. It also counts that I spent more days working on fiction in April.</li>\n</ol>\n\n<p><strong>Here are my goals for May:</strong></p>\n\n<ol>\n  <li>Start something new, whether it's a short story or a script for a new web series.</li>\n  <li>Spend some time working on the outline for my screenplay. Don't let it lay fallow for too long.</li>\n  <li>Don't leave writing until the end of the day. Write more before work or during my lunch break. Take time to write at the library or a coffee shop.</li>\n</ol>\n\n<!--[Highland-CursorPosition-Start]\n{5182,2235.0}\n[Highland-CursorPosition-End]-->\n",
			"image": "https://unsquare.com/images/pen-paper-feature.jpg",
            "url": "https://unsquare.com/blog/april-by-the-numbers/",
            "date_published": "2016-05-01 00:00:00 -0700"
        },

        {
            "id": "/blog/march-by-the-numbers",
            "title": "March by the Numbers",
            "content_html": "<p>Tracking your writing can be kind of brutal after a while, especially if you have a month where it feels like you didn't hit your goals. March was one of those months despite the fact that I was actually very productive in a few important ways.</p>\n\n<p>First off, a lot of my writing time in March was devoted to several weeks of my <a href=\"http://storyandplot.com\">screenwriting class</a>. We read scripts (written by class members) and watched a few movies to understand their structures. We were also given the occasional homework assignment specific to our script ideas.</p>\n\n<p>I counted my time spent in class or working on assignments under the \"Related Work\" column of my spreadsheet, because it was a valuable use of my time that required a decent amount of mental energy. That time spent also tended to preclude any other kind of writing work.</p>\n\n<p>Additionally, because I needed to devote my time to class (I did pay for it, after all), I made a point of setting aside my short stories until class was finished. This meant that my fictional output was almost non-existent in March.</p>\n\n<p>As for my non-fiction writing, I published four book reviews over at <a href=\"http://fullofwords.com\">Full of Words</a> and four posts on this site. Those eight posts amount to 4171 words altogether, which means I did around 1552 words of journal-writing.</p>\n\n<p>I'm actually pretty proud of myself for writing eight posts in one month - that's an average of two posts a week. It's a rare month when I blog that consistently, so good on me.</p>\n\n<p>Even though I wrote a good number of blog posts and spent a lot of time working on assignments for class, I felt like I wasn't productive enough because my fiction word count was so low.</p>\n\n<p>Maybe it's just a psychological hang-up that I need to get over, but it doesn't really feel like I'm achieving my writing goals if I'm not producing a quantifiable number of words (or pages).</p>\n\n<p>Fiction writing feels like a more achievable goal than screenwriting, so that's probably why I'm so focused on word count as a metric.</p>\n\n<p>I don't really want to start producing screenplay pages before I have an outline ironed out. I know for a fact that I'd have to throw out a bunch of work if I started writing without planning. I know it's a delaying tactic, but that doesn't mean it's wrong.</p>\n\n<p>Ghost of a Friend is a good example of what happens when I write without planning. I've reworked it significantly after every rewrite, and I don't think I discovered the core of the story until after multiple rounds of feedback and rewrites. That's kind of an inefficient process… but somehow it produces results, flawed as they may be.</p>\n\n<p>I know in my heart of hearts that outlining improves my writing, but for some reason I still freeze up at the thought of planning out a story. Some stubborn idiot part of my brain rebels and I don't get anything done.</p>\n\n<p>I'm not really sure where to go from here other than trying to tip the balance towards outlining instead of just pantsing everything.</p>\n\n<p><strong>My final counts for March 2016 were:</strong></p>\n\n<ul>\n  <li>26.5 hours of related work</li>\n  <li>0 script pages</li>\n  <li>559 words of fiction</li>\n  <li>5723 words of non-fiction</li>\n  <li>6282 total words</li>\n</ul>\n\n<p><strong>To recap, these were my goals for March:</strong></p>\n\n<ol>\n  <li>Finish a draft of an outline for my screenplay.</li>\n  <li>Do a final pass on my newest short story and submit it for publication.</li>\n  <li>Fewer journal entries and more fiction.</li>\n</ol>\n\n<p><strong>Here's how those goals actually played out:</strong></p>\n\n<ol>\n  <li>I didn't draft an outline, but I did come up with a list of ten set-pieces that feel really solid. I can see a potential through-line for the movie in those pieces, so it's just a matter of formalizing it. I made measurable progress, but I didn't end up with a finished product like I'd hoped.</li>\n  <li>I made it halfway through a final pass on Ghost of a Friend. I stopped at the point when I realized that I needed to rewrite a huge chunk of the story. I'd also spent almost four hours working on the rewrite and it was time to leave the coffee shop.</li>\n  <li>I feel like I whiffed on this one. My only attempts at fiction-writing were fitful stabs at starting a new short story. I'm not really happy with any of those fragments, so it's back to the drawing board with my new ideas. I also resorted to writing in my journal way too many nights.</li>\n</ol>\n\n<p><strong>Here are my goals for April:</strong></p>\n\n<ol>\n  <li>Finish my final rewrite of Ghost of a Friend and submit it to <em>at least one market</em> by the end of the month.</li>\n  <li>Create my outline board (i.e. draw lines on the board and lay out the sections) and outline <em>at least one sequence</em> of my screenplay.</li>\n  <li>Find more ways to get concrete wins that make me feel like I'm progressing as a writer.</li>\n</ol>\n\n",
			"image": "https://unsquare.com/images/vintage-typewriter-feature.jpg",
            "url": "https://unsquare.com/blog/march-by-the-numbers/",
            "date_published": "2016-04-01 00:00:00 -0700"
        },

        {
            "id": "/blog/writing-the-heming-way",
            "title": "Writing the Heming-way",
            "content_html": "<p>As an experiment, I decided to start using <a href=\"http://hemingwayapp.com\">Hemingway</a> to proof my blog posts and work assignments. Hemingway is a free web-based tool that catches a few common grammatical sins and rates the \"readability\" of your text.</p>\n\n<p>My corporate writing is meant for a wide audience known for their short attention span, so making sure that my newsletters and documentation are clear and simple is a priority. Hemingway works really well in this scenario, and it's okay if the results come out a little bland.</p>\n\n<p>As for my blog, the most common posts I make are book reviews meant for a general audience. If someone finds my site from a Google search, it's important that my content be accessible. That said, I do tend to make the occasional rhetorical flourish when I'm passionate about a book, and those are oftentimes my favorite posts. I'm confident that my best writing would never pass Hemingway's readability standards.</p>\n\n<p>After a few days of using Hemingway for my writing, I started feeling stifled by its rules. I need all the help I can get when it comes to avoiding passive voice, but I'm not sure I think that complex sentences are such a big deal, and adverbs do have their place now and then.</p>\n\n<p>Unfortunately, whenever Hemingway highlights something in my writing, my instinct is to rewrite that section obsessively until the highlight is gone. This means that I massage complex sentences until they are uniform in length and simplicity. This might make my writing easier to read, but I also think it removes a lot of what makes me unique and interesting as a writer.</p>\n\n<p>When the app first launched, one of the first things people pointed out is that <a href=\"http://www.newyorker.com/books/page-turner/hemingway-takes-the-hemingway-test\">even Hemingway wouldn't pass all the app's rules 100% of the time</a>. The dirty little secret of English grammar is that a lot of the rules are just suggestions to ignore whenever your writing style calls for it.</p>\n\n<p>For example, I recently read <a href=\"http://fullofwords.com/reviews/treacherous-parts-you-too-can-have-a-body-like-mine/\">You Too Can Have a Body Like Mine</a>, which has such a high rate of adverbs per paragraph that it was clearly a conscious stylistic choice by the author. Whether that choice was <em>successful</em> is another question entirely.</p>\n\n<p>For now, I've stopped running my day-to-day writing through Hemingway. I suppose I could always use it to check for passive voice and ignore all its other suggestions, but that would take a bit of restraint on my part.</p>\n\n",
			"image": "https://unsquare.com/images/hemingway-feature.jpg",
            "url": "https://unsquare.com/blog/writing-the-heming-way/",
            "date_published": "2016-03-31 00:00:00 -0700"
        },

        {
            "id": "/blog/what-im-patreonizing",
            "title": "What I'm Patreonizing",
            "content_html": "<p>I've Kickstarted a few things over the years, but I'm much slower on the trigger these days. There aren't any projects I regret funding, but there are definitely categories I don't fund any more.</p>\n\n<p>I have more than enough games to play, for example, and I've barely scratched the surface of the ones I funded through Kickstarter. Instead, I put most of my funding dollars towards fiction magazines and anthologies. They always seem like worthy causes even if I never get around to reading the stories. Also, magazines tend to deliver their rewards on time.</p>\n\n<p>I've also shifted most of my funding towards Patreon instead of Kickstarter. Most of the creators I want to support release content on a regular schedule. They've all realized that it makes way more sense to send them a few dollars every month instead of hoping they reach full funding for their newest campaign.</p>\n\n<p>One of the first people I supported on Patreon was Jeph Jacques, who created <a href=\"http://questionablecontent.net\">Questionable Content</a>, the only webcomic I still follow.</p>\n\n<p>When I first started reading QC, I read maybe a decade of his strips in a few days' time. I enjoyed them so much that I bought the collected editions as a way to pay him back for all of that entertainment. Patreon is actually a much better way to support him because his comics never really looked right in print. I can also show my support on an ongoing basis instead of whenever I decide to order a book from him.</p>\n\n<p>One of the creators I've supported on both Kickstarter and Patreon is <a href=\"http://firesidefiction.com\">Fireside Fiction</a>, a magazine that has been around for a few years now. I support Fireside because they pay really nice professional rates, and they publish authors I enjoy. I want Fireside to stick around long enough that I have the chance to submit a story.</p>\n\n<p>When they were doing yearly Kickstarters, there was always the danger they might miss their target and close up shop. Now that they've transitioned over to Patreon and reached a sustainable level, there's a much better chance they'll stick around for a good long time.</p>\n\n<p>The final creator I'm funding is <a href=\"http://strangehorizons.com\">Strange Horizons</a>, another magazine. If I remember correctly, I started funding them because they were having a fund drive and authors I follow on Twitter were advocating for them. I really just like supporting fiction markets because I want more chances to submit my stuff to some cool places. Also I always want to read more good short fiction.</p>\n\n<p>In the future, I'll probably favor Patreon over any new Kickstarters. I think the only project I've funded over there recently is a blu-ray collection of <a href=\"http://www.bitterfilms.com\">Don Hertzfeldt's</a> short films, which seemed like a worthwhile thing to own.</p>\n\n<p>I think I'd rather put my money towards things I'm already enjoying instead of projects that might pay off two years down the line.</p>\n\n",
			"image": "https://unsquare.com/images/money-feature.jpg",
            "url": "https://unsquare.com/blog/what-im-patreonizing/",
            "date_published": "2016-03-07 00:00:00 -0800"
        },

        {
            "id": "/blog/collaboration-is-key",
            "title": "Collaboration Is Key",
            "content_html": "<p>Writing is a bit of a contradiction: the physical act of writing usually happens in solitude, but the only way to succeed at writing is through collaboration.</p>\n\n<p>When I say that, I don't just mean the sorts of collaborations where two people sit down and try to write one story. I also mean collaboration in the sense that everyone who gives you feedback or helps you brainstorm is a collaborator.</p>\n\n<p>The people in your support system can be some of the most important collaborators you'll ever have, even if the only credit they'll ever get is in the acknowledgements or a thank you speech at an awards ceremony.</p>\n\n<p>There is this romantic idea of the writer who disappears into a cabin somewhere and whips up the Great American Novel, fully formed. It's complete bullshit.</p>\n\n<p>Even masterpieces needed a good editor, and all of the classic authors worked with one. Most of them probably also had beta readers, friends, and spouses who read their work and gave them feedback.</p>\n\n<p>I've been working hard to develop my craft by doing something writing-related every day, but making a habit is just the first step on my path to development. Whenever I finish a new unit of story, I can't just send it out into the world and try to win awards or get it published. Instead, I need the reality check of some good feedback from people I trust.</p>\n\n<p>In fact, I'd say that I need the help of others at all points in the process - <strong>before</strong>, <strong>during</strong> and <strong>after</strong>.</p>\n\n<ol>\n  <li>My writing turns out much better whenever I have someone to use as a sounding board for my ideas.</li>\n  <li>I'm far more motivated to write when I know people are waiting for my work.</li>\n  <li>My stories are only ever improved by the cycle of feedback and rewrites.</li>\n</ol>\n\n<p>The biggest problem I'm facing right now is that asking for feedback is an imposition on someone else's time. Everyone who reads my story is doing me a favor, especially if they read it quickly.</p>\n\n<p>I recently sent my newest story out to a few friends and asked for their feedback. More than one of them was kind enough to do me the favor of reading my story and providing a thoughtful, detailed response. Everything they've told me is going to be a huge help once I actually get around to doing my final rewrite, but even as I appreciated their feedback, it occurred to me that I can only ask my friends for this kind of favor so many times.</p>\n\n<p>I mean, sure, I have great friends who are more than willing to help me out, and I'm definitely willing to do the same for them whenever I can, but I don't want to abuse that relationship. If I'm using up favors every time I ask for feedback on one of my stories, it feels like I should save those favors for when I really need them.</p>\n\n<p>What I really need is some kind of arrangement that doesn't rely on the kindness of my friends. Finding a writing group would be the ideal solution. Writing groups are founded on the principle that everyone has to give and get feedback on a regular basis. I wouldn't feel guilty about asking a group to read my stuff because I'd be earning my keep by reading their work in return.</p>\n\n<p>The problem with writing groups is that I can't seem to find one to join, and I haven't had any luck trying to found one. I talked to a few writers from last year's screenwriting class about starting a group, but I couldn't get anyone to commit to actually getting together for a meeting. Eventually everyone just stopped responding to my emails and I wrote off the whole thing.</p>\n\n<p>I'm planning on trying again with my newest class, but I'm not sure how much more successful I'll be. At least one person in class seems driven enough to actually make good on a writing group, but I'm not sure about everyone else. That also wouldn't solve my problem when it comes to getting feedback on short stories; any group I found with the people from class would naturally focus on screenwriting.</p>\n\n<p>I'd also like to figure out how to find myself a writing partner. Writing <a href=\"http://smoothfewfilms.com/theleetworld/\">The Leet World</a> with <a href=\"http://eddyrivas.com\">Eddy</a> is the closest I've ever come to a true writing partnership, but he's a busy dude and I think we have different priorities for our writing. It would also be a big help if I could find a partner who actually lived in the same place as me.</p>\n\n<p>For now, I'm going to keep plugging away on my own while I work on building up that network of collaborators.</p>\n\n",
			"image": "https://unsquare.com/images/collaboration-feature.jpg",
            "url": "https://unsquare.com/blog/collaboration-is-key/",
            "date_published": "2016-03-03 00:00:00 -0800"
        },

        {
            "id": "/blog/february-by-the-numbers",
            "title": "February by the Numbers",
            "content_html": "<p>The second month is usually where it all falls apart. My dedication to a goal starts slipping and I start coming up with more and more reasons why I don't <em>actually</em> need to keep doing it.</p>\n\n<p>The last few times I've tried to commit to a daily writing habit, I've given up pretty quickly after that first month. I'm sure that one of the reasons I've had a hard time sticking to my goals is that I made it very easy to fail. This time around, I've done what I can to give myself more ways to succeed, and so far it seems to be paying off.</p>\n\n<p>I had a bit of a dip in productivity in February, but I still reached a few milestones. My overall output was lower versus January, but I finished a second draft of my newest short story on February 10th. I sent it off for feedback and received some very thoughtful responses, but I haven't actually sat down to start my next (and hopefully final) revision.</p>\n\n<p>Instead, I've been trying to focus on work for my screenwriting class, which does take up a decent chunk of time every week. I'm still stuck in the brainstorming stage, but I'm hoping to make some concrete progress soon. i want to turn in my outline and get some feedback. I keep telling myself that I'm going to sit down and devote a solid chunk of time to some serious brainstorming, but I've been bad about setting aside the hours.</p>\n\n<p>I feel like I used journaling as a fallback more in February than I did in January. I'm also counting my time spent in class or doing homework under the \"related work\" column. This meant that there were several days in a row where I counted nothing but work for class. Although outlining and brainstorming are crucial parts of the creative process, I'd like to avoid having to count journal entries as my daily writing if at all possible.</p>\n\n<p><strong>My final counts for February 2016 were:</strong></p>\n\n<ul>\n  <li>20 hours of related work</li>\n  <li>0 script pages</li>\n  <li>2878 words of fiction</li>\n  <li>5257 words of non-fiction</li>\n  <li>8135 total words</li>\n</ul>\n\n<p><strong>Here are my goals for March:</strong></p>\n\n<ol>\n  <li>Finish a draft of an outline for my screenplay.</li>\n  <li>Do a final pass on my newest short story and submit it for publication.</li>\n  <li>Fewer journal entries and more fiction.</li>\n</ol>\n",
			"image": "https://unsquare.com/images/hands-coffee-cup-apple-feature.jpg",
            "url": "https://unsquare.com/blog/february-by-the-numbers/",
            "date_published": "2016-03-02 00:00:00 -0800"
        },

        {
            "id": "/blog/from-draft-to-draft",
            "title": "From Draft to Draft",
            "content_html": "<p>I recently finished the second draft of a new short story, and at the moment I'm feeling pretty good about it.</p>\n\n<p>The story was inspired by a prompt from <a href=\"http://the-five-hundred.com\">The Five Hundred</a> that I used as a jumping-off point and then ultimately ignored. The story wasn't finished after 500 words, and I was feeling inspired, so I just kept going.</p>\n\n<p>I finished the first draft on <strong>January 17th</strong> with a total of <strong>3123 words</strong>. I sent it off to a few people to read and got two sets of feedback, both of which were very helpful.</p>\n\n<p>The next step was to print out the draft and read it aloud with a red pen in my hand. I ended up doing rewrites and tweaks throughout. I think the combination of reading it aloud and working from a printed copy helped me get some necessary perspective on the story.</p>\n\n<p>As I read through the story, I changed the narration from present-tense to past-tense. I also decided to delete several unnecessary characters and give two of the remaining characters more scene time. Finally, I came up with something more active for the main character to do, since one piece of feedback I got was that he was very passive throughout.</p>\n\n<p>After I finished the red pen read-through, I let a few days pass before I sat down and incorporated the changes into my <a href=\"https://www.literatureandlatte.com/scrivener.php\">Scrivener</a> draft. Once that was done, I got down to the business of writing a new scene in the middle of the story as well as a new ending.</p>\n\n<p>When I finished the second draft on <strong>February 10th</strong>, it came in significantly longer at a total of <strong>4422 words</strong> despite the fact that I'd deleted two scenes. I started the story on January 14th and finished the second draft slightly less than a month later, which is a pretty decent turnaround time.</p>\n\n<p>As soon as I finished the second draft, I sent it off to my beta readers. I included two new people who didn't get a chance to read it the first time around. My hope is that I'll get some fresh perspectives on the story from people who never saw the first draft.</p>\n\n<p>Although I feel good about the story, I'm not entirely sure if I pulled off the ending. I'm looking forward to seeing what my readers have to say about it. Ideally, I'd like to start submitting this story before the end of February.</p>\n\n<p>As for what comes next in my writing queue, I need to spend some quality time with my outline for screenwriting class. I let story rewrites take precedence and now I don't  have much to show for myself at this week's class.</p>\n\n<p>Although I would like to have more than one story ready for submission, I don't want to neglect my outline. That means I'm going to put a pin in my stories for the time being and focus on getting my outline into shape as soon as possible.</p>\n\n",
			"image": "https://unsquare.com/images/rewrites-feature.jpg",
            "url": "https://unsquare.com/blog/from-draft-to-draft/",
            "date_published": "2016-02-13 00:00:00 -0800"
        },

        {
            "id": "/blog/january-by-the-numbers",
            "title": "January by the Numbers",
            "content_html": "<p>Writing in January went pretty well overall. I started by writing a little bit of fiction every day and I eventually pulled off a streak that lasted through the end of the month.</p>\n\n<p>Right near the end I decided that I needed to figure out a way to count working on an outline, because I spent that last Friday and Saturday getting ready for my screenwriting class and all of my energies were devoted to my outline instead of writing or rewriting.</p>\n\n<p>I updated my spreadsheet so that I could count the hours I spent in class or working on my outline. Problem is, it feels a bit like cheating even though it's a pretty important part of the process.</p>\n\n<p>Unfortunately, I think I lost a bit of momentum after two days of not adding new words or pages to my counts. I'm sure it's just a mental hang-up, but I think if I do devote more days to nothing but outlining, it would help me feel better if I also did something like writing a journal entry so that I have some writing progress to count.</p>\n\n<p>Also, I think if I go too many days without taking at crack at writing fiction, I get too much in my head about it and I tend to write a blog post or a journal entry as an avoidance tactic.</p>\n\n<p>And, of course, I have work that I need to do for class. I need to read a script so that I can give feedback, and I need to make some measurable progress on my outline.</p>\n\n<p>When I took screenwriting classes in Austin, I never produced anything. I don't want to repeat that mistake.</p>\n\n<p><strong>My final counts for January 2016 were:</strong></p>\n\n<ul>\n  <li>6 hours of related work</li>\n  <li>4 script pages</li>\n  <li>5136 words of fiction</li>\n  <li>7601 words of non-fiction</li>\n  <li>12737 total words</li>\n</ul>\n\n<p>Here's to a solid February full of writing!</p>\n",
			"image": "https://unsquare.com/images/hands-coffee-cup-apple-feature.jpg",
            "url": "https://unsquare.com/blog/january-by-the-numbers/",
            "date_published": "2016-02-01 00:00:00 -0800"
        },

        {
            "id": "/blog/screenwriting-class-round-two",
            "title": "Screenwriting Class, Round Two",
            "content_html": "<p>I signed up for the 201 level of Tom Vaughan's <a href=\"http://storyandplot.com\">Story and Plot</a> class a few weeks ago, and I'm really looking forward to it. The class starts next Saturday, and this time around we're actually going to be writing script pages. I enjoyed the 101 class a lot, but it's definitely time I started writing a script of my own instead of limiting my creative energies to short stories and <a href=\"http://smoothfewfilms.com/theleetworld\">The Leet World</a>.</p>\n\n<p>I have two ideas that feel like feature films, but of course I'm planning on using the idea I didn't bring to class last time around just because I want to make things difficult for myself.</p>\n\n<p>The idea I brought last time is a contained sci-fi thriller about what might happen if teleporters existed and garage inventors started tinkering with them. The problem is that I couldn't figure out what the character arcs needed to be; it was more of a philosophical premise than an actual character-based story. I never spent the time necessary to develop it into an actual working script, but I don't plan on abandoning it entirely. I'll just come back to it some other time.</p>\n\n<p>This time around, I've decided to focus on an idea that I originally thought might work best as a web series. It's a story about a home-brewer who stumbles into a world of magical beer recipes and secret societies. I have a much clearer idea of the main character's story arc, so I think I'll be able to come up with a decent outline pretty quickly and start producing pages.</p>\n\n<p>As for the outline, I'm using <a href=\"https://en.wikipedia.org/wiki/Amazon_Storywriter\">Amazon Storybuilder</a> to create a corkboard version. I feel like I have a pretty solid first act mapped out, but I'm not sure where the script needs to go from there. I'm planning on using the rest of this week to complete the handouts from the 101 class and fill out the outline as much as possible before class begins.</p>\n\n",
			"image": "https://unsquare.com/images/typewriter-feature.jpg",
            "url": "https://unsquare.com/blog/screenwriting-class-round-two/",
            "date_published": "2016-01-24 23:41:26 -0800"
        },

        {
            "id": "/blog/how-to-turn-wordpress-into-a-static-site-using-ampps-and-simply-static",
            "title": "How to Turn Wordpress Into a Static Site Using AMPPS and Simply Static",
            "content_html": "<p>After much tinkering, I <em>finally</em> figured out how to make a decent static backup of my <a href=\"http://old.unsquare.com\">old Wordpress site</a>. I kept running into problems no matter my approach - whether I tried the web interface or <a href=\"https://en.wikipedia.org/wiki/Wget\">wget</a> - but I had a brainstorm recently that solved a lot of my issues.</p>\n\n<p>The main problem with trying to create a backup in the Wordpress web interface is that my site is on <a href=\"http://dreamhost.com\">shared hosting</a> and Wordpress is a resource hog. It's one of the reasons I wanted to switch to <a href=\"http://jekyllrb.com\">Jekyll</a> in the first place. I'm unlikely to ever be able to afford dedicated hosting, so switching to a static site was definitely an economic choice.</p>\n\n<p>It's also just a matter of impatience. If you try to do anything involved in Wordpress on shared hosting, you'll probably hit the upper limit of your server's memory and your site will crap out.</p>\n\n<p>That's what happened every time I tried to generate a static copy of my site with a plugin called <a href=\"https://wordpress.org/plugins/simply-static/\">Simply Static</a>. The plugin would load for a few long minutes and then return an error message.</p>\n\n<p>As for wget, it might just be too convoluted for my purposes. I could never quite figure out the right combination of options to download my site without also downloading a bunch of unnecessary garbage. It was also a pretty slow process. Whenever I inevitably realized halfway through that I'd included the wrong options, it meant I had to start over from the beginning.</p>\n\n<p>My brainstorm was when I realizes that I could use <a href=\"http://www.ampps.com\">AMPPS</a> (or <a href=\"https://www.mamp.info/en/\">MAMP</a>, if you prefer) to create my own dedicated server. See, I really only need the server for as long as it takes to spit out a static copy, so it would be absurd to pay for hosting.<!-- more --></p>\n\n<p>Here is the process that I used:</p>\n\n<ol>\n  <li>Download a copy of your Wordpress installation using an FTP program.</li>\n  <li>Log in to your site's PHPMyAdmin and export a copy of your Wordpress MySQL database.</li>\n  <li>Install <a href=\"http://www.ampps.com\">AMPPS</a> or <a href=\"https://www.mamp.info/en/\">MAMP</a> on your local system. I used AMPSS, so I'll provide instructions for that app, but MAMP has a lot of the same features.</li>\n  <li>Open AMPPS and go into the PHP settings, then select the PHP Extension option. Check the box next to <strong>zip.so</strong>, which is required to use the Simply Static Plugin. It won't hurt if you also change your PHP version to 5.6.</li>\n  <li>Now, start Apache and MySQL in AMPPS.</li>\n  <li>Click the house icon in AMPPS to open the AMPPS dashboard, then go to <strong>Add Domain</strong> and create a record for your domain.\n    <ul>\n      <li>One of the nice things about AMPPS is that if you create a record for an existing domain, AMPPS can update your <a href=\"https://en.wikipedia.org/wiki/Hosts_(file)\">hosts file</a> so that your browser loads the local copy instead of the live site. However, once you're done with this process, you will need to remove the domain from AMPPS to reset your hosts file.</li>\n      <li>If you want to use a fake domain like <strong>your-site-url.dev</strong>, keep in mind that you will need to <a href=\"https://codex.wordpress.org/Changing_The_Site_URL\">change the site url in your wp-config file</a> to make it work.</li>\n    </ul>\n  </li>\n  <li>Copy your Wordpress installation into the folder AMPPS created for your domain.</li>\n  <li>Return to AMPPS and open PHPMyAdmin. Create a new MySQL database, then use the <strong>Import</strong> option to upload the copy of your Wordpress database you downloaded.</li>\n  <li>Update your local wp-config file to reflect the AMPPS MySQL login information, which is available under <strong>MySQL Password</strong> in AMPPS. You'll also need to use localhost as your MySQL server.</li>\n  <li>Open the domain you created in a web browser. If everything went to plan, you should be viewing a locally-running copy of your Wordpress site.</li>\n  <li>Log in to your local site's Wordpress admin.</li>\n  <li>Deactivate all Wordpress plugins that don't provide a required feature.</li>\n  <li>Remove the meta widget and/or any login links anywhere on your theme.</li>\n  <li>Install and activate a plugin that disables your RSS feeds. I found one called <a href=\"https://wordpress.org/plugins/disable-feeds/\">Disable Feeds</a>.</li>\n  <li>Install and activate a plugin that generates a static copy of your site. There are a few different plugins available, but the one that worked best for me was <a href=\"https://wordpress.org/plugins/simply-static/\">Simply Static</a>.</li>\n  <li>If you're feeling super-diligent, go through all of your posts with a fine-toothed comb and find all of the broken video embeds from ten years ago, weird code that relies on long-forgotten plugins, etc. I've done this in fits and starts but I have a loooong way to go before all of those old posts are actually fixed.</li>\n  <li>Now, open the Simply Static settings and confirm that everything is configured correctly. If you're moving your static site to a new domain, you can specify that in the settings.</li>\n  <li>Choose the Generate option, then sit back and wait. Once Simply Static is done, you'll have the option of downloading a zipped copy of the static files.</li>\n  <li>Extract the zipped files and upload them wherever you want your static site to live.</li>\n  <li>Open your new static domain to confirm that everything is working properly. Once you're sure the static site looks the way you want it, remove any local versions of your site from AMPPS and you're good to go!</li>\n</ol>\n\n<p>Although I was able to create a copy of my site using this process, I'd still like to go through old posts and fix broken embeds and links before I say it's completely done. That will probably take a while, just because I hate looking at my posts from so long ago.</p>\n\n",
			"image": "https://unsquare.com/images/coding-feature.jpg",
            "url": "https://unsquare.com/blog/how-to-turn-wordpress-into-a-static-site-using-ampps-and-simply-static/",
            "date_published": "2016-01-23 11:42:51 -0800"
        },

        {
            "id": "/blog/what-im-writing-right-now",
            "title": "What I'm Writing Right Now",
            "content_html": "<p>OK, so: I'm writing every day, and doing my best to maintain my streak, which means I have a few different irons in the fire at all times. Options are good! That's how I've met my <a href=\"https://www.goodreads.com/user_challenges/3899793\">reading goals</a> year after year - by reading at least a half-dozen books at the same time.</p>\n\n<p>I have three (maybe four) stories that I would currently consider \"active\" right now. What I mean by active is that I'm actually trying to complete them and get them ready for submission. On days when I'm not ready to dive in to one of my stories, I've been trying to prioritize blog posts, although there are a handful of days when I've fallen back on writing a journal or rewriting an existing story.<!-- more --></p>\n\n<p><strong>Story #1: A listicle that takes a turn</strong></p>\n\n<p>The first story I started this year is a variation on an idea I originally tried writing for a submission prompt a year or so ago but never finished. I thought it would be entertaining to tell a story in the form of a <a href=\"https://www.thrillist.com/eat/los-angeles/glendale/best-la-donuts\">Thrillist</a> best-of list that slowly turns into something else entirely.</p>\n\n<p>I have a completed draft of this story, but it feels like it needs a lot of work. I'm planning on giving it another pass and trying to pull out the story arc a little more, but I definitely need to pick it up soon before I forget what I wanted to do with it. I've taken some notes on hoe I think I should re-work it, but I haven't picked it up again and I'm not entirely sure how I feel about it.</p>\n\n<p><strong>Story #2: My Kelly Link cover song</strong></p>\n\n<p>Have I mentioned that <a href=\"http://kellylink.net\">Kelly Link</a> is one of my most favorite short story writers? I love basically everything she's ever done, and I aspire to pulling off something half as unsettling as what she achieves in even her lesser works.</p>\n\n<p>This story is definitely in the Link wheelhouse, but hopefully I've put enough of my own stamp on it to make it stand apart. It helps that it's easily the most autobiographical story I've written in a long time.</p>\n\n<p>It's also the longest piece of fiction I've finished since my currently-abandoned story about a man falling in love with an Amazon drone. I actually feel pretty good about it right now, which is a new feeling. I'm currently waiting for feedback from a few people and letting it lay fallow before I take another pass, but as soon as I do, I'm going to send this one out for submissions until my fingers fall off.</p>\n\n<p>The craziest thing about this story is that I started it because I was trying to write for a prompt from <a href=\"http://the-five-hundred.com\">The Five Hundred</a>, but it quickly grew into a much bigger story that didn't end up working for the prompt at all.</p>\n\n<p><strong>Story #3: Flash for Mash</strong></p>\n\n<p><a href=\"http://mashstories.com\">Mash Stories</a> is quarterly prompt-based competition for flash fiction. The rules are as follows: every story has to be a maximum of 500 words and include all three words for the quarter. This quarter's words are <em>mug</em>, <em>extractor</em> and <em>happiness</em>. I wrote a story for the prompt a few days ago, but I'm not quite sure if it's ready for prime time.</p>\n\n<p>Honestly, it's really hard to tell a proper story in under five hundred words. I haven't shared this story with anyone yet, but I think I will soon. I want to give it at least one more pass before I submit it to the competition. I have until April 15th, so I have plenty of time to make this story work.</p>\n\n<p><strong>Story #4: The one I wrote before</strong></p>\n\n<p>I actually posted a very different version of this story on my blog years ago, but it's been knocking around in my head ever since, and I've come up with a number of variations and new interpretations. I've actually mapped this one out in [Scrivener][s] and everything, but I haven't touched it in a few weeks.</p>\n\n<p>I'm only including this in my \"active\" list because I've outlined it enough that I can totally finish it if I just sit down and make the effort. This will probably be the story I work on next, just because I'd like to release this idea from my brain.</p>\n\n<hr />\n\n<p>Writing every day is a tough challenge, but knowing that I've got a solid streak going is definitely a good incentive to keep me writing.</p>\n\n<p>Pretty soon I'm going to start a screenwriting class - on the 30th - and whenever Eddy decides it's time, we'll start writing another episode of The Leet World. That should help keep me busy.</p>\n\n<p>No matter what, I think I'll keep doing this regular check-ins to keep me honest… and give me an option when I need to find something to write.</p>\n\n",
			"image": "https://unsquare.com/images/writer-writing-feature.jpg",
            "url": "https://unsquare.com/blog/what-im-writing-right-now/",
            "date_published": "2016-01-21 21:51:25 -0800"
        },

        {
            "id": "/blog/one-more-time-with-the-writing-tracker",
            "title": "One More Time With the Writing Tracker",
            "content_html": "<p>If you've met me, you probably know that I love tracking things.</p>\n\n<ol>\n  <li>I've kept track of my reading habits on <a href=\"http://goodreads.com\">Goodreads</a> (and other services) since 2006. That's <em>almost a decade</em> at this point.</li>\n  <li>I've owned three <a href=\"http://fitbit.com\">Fitbits</a> over the years and am constantly trying to figure out ways to get more steps so that I can reach 10,000 steps a day.</li>\n  <li>Whenever I decide that it's time to lose weight, I use apps like <a href=\"http://loseit.com\">Lose It</a> or <a href=\"http://myfitnesspal.com\">MyFitnessPal</a> to track calories (until I get frustrated and eat all of the calories I can find).</li>\n  <li>One of the main ways I've tried to get serious about my writing is by tracking my daily output. I've had some success with this in the past, but whenever I've failed, I've failed spectacularly and gone months without writing a word.</li>\n</ol>\n\n<p>This year I'm making an effort to track all of those things again because I'm a masochist. They're basically listed in order of how difficult I find them to achieve.<!-- more --></p>\n\n<p>Reading a bunch of books every year comes pretty naturally to me at this point, although I do sometimes pad my numbers by reading a graphic novel or novella. Still counts, though!</p>\n\n<p>Getting my steps in is much easier when it stays light past 5pm during the week. I don't really like going to the gym that much, but I do like walking around a park listening to an audiobook, so I'm definitely looking forward to the end of winter.</p>\n\n<p>Losing weight is a constant struggle. I'm pretty good at eating a specific breakfast and lunch, and I even do a decent job of not eating terrible snacks while I'm at work. The problems happen when I get home and there are unlimited snacks available and I just throw up my hands and don't even bother trying to track what I ate for dinner.</p>\n\n<p>Tracking my writing is the real doozy. A few years ago I managed to write <a href=\"https://unsquare.com/blog/write-every-day-for-a-month-part-one-of-twelve/\">every day for the entire month of January</a>. I was pretty proud of myself, but my streak fell apart shortly thereafter.</p>\n\n<p>This year I've created a new version of <a href=\"https://www.dropbox.com/s/rznys4s248te8ne/Writing%20Tracker%20-%202016.xlsx?dl=0\">my tracking spreadsheet</a>, and I'm slowly but surely building a streak by writing something every day. I feel good about my goal so far. I just finished a new story this weekend, and I'm really proud of how it turned out.</p>\n\n<p>It definitely helps that I've figured out how easy it is to meet my goal by opening <a href=\"http://agiletortoise.com/drafts/\">Drafts</a> on my iPhone and writing <strong>literally anything</strong> for fifteen minutes. That's about all the time I need to produce a minimum of 100 words, which is the bar I've set for myself. If I'm on a roll, I can crank out way more than that.</p>\n\n<p>In fact, writing this post means I've met my goal for the day today, which is very meta of me. I'm going to keep checking in on my writing goals constantly in the hopes that it'll keep me accountable. I'm also looking forward to finishing a story to the point that I can submit it and start playing <a href=\"http://sinkorsub.herokuapp.com\">Sink or Submit!</a>.</p>\n\n",
			"image": "https://unsquare.com/images/writing-feature.jpg",
            "url": "https://unsquare.com/blog/one-more-time-with-the-writing-tracker/",
            "date_published": "2016-01-19 17:07:50 -0800"
        },

        {
            "id": "/blog/i-made-a-new-website",
            "title": "Look, I Made a New Website!",
            "content_html": "<p>After much tinkering, I've finally decided to replace my <a href=\"http://wordpress.org\">Wordpress</a> site with a brand-spanking new static version generated in <a href=\"http://jekyllrb.com\">Jekyll</a>.</p>\n\n<p>The <a href=\"http://jekyllrb.com\">Jekyll</a> installation currently lives on an <a href=\"http://aws.amazon.com/ec2/\">Amazon EC2</a> instance so that I can rebuild it from anywhere, but if EC2 starts costing too much money, I'll probably configure it on one of my Macs instead.</p>\n\n<p>I generally use a <a href=\"https://www.basbarten.nl/jekyll-deployment/2015/a-simple-shell-script-for-deployment/\">shell script</a> to deploy the site; first, it does a Jekyll build, then it uses rsync to transfer the files from EC2 to Dreamhost via ssh/sftp. It took a little bit to figure out how to get ssh keys set up on both so that rsync wouldn't prompt for a password, but in the end it all came down to <a href=\"https://help.dreamhost.com/hc/en-us/articles/215906508-Troubleshooting-passwordless-login\">file permissions</a>. I've also configured <a href=\"https://github.com/ruby/rake\">Rake</a> so that I can test my build with <a href=\"https://github.com/gjtorikian/html-proofer\">html_proofer</a> and deploy the site using my Rakefile.</p>\n\n<p>The coolest part? Thanks to Panic's <a href=\"https://panic.com/coda-ios/\">Coda for iOS</a>, I can deploy the whole thing from my iPhone - start to finish!</p>\n\n<p>The current template is called <a href=\"http://mmistakes.github.io/skinny-bones-jekyll/\">Skinny Bones</a>. I've tweaked it a little bit here and there, but it's mostly the same.</p>\n\n<p>An archival version of my old site currently lives on at <a href=\"http://old.unsquare.com\">old.unsquare.com</a>. I've only ported over a selection of my old posts, and I may eventually take the old site down completely.</p>\n\n",
			"image": "https://unsquare.com/images/mad-scientist-feature.jpg",
            "url": "https://unsquare.com/blog/i-made-a-new-website/",
            "date_published": "2015-12-18 00:00:00 -0800"
        },

        {
            "id": "/blog/girls-nudity-critical-foot-mouth-disease",
            "title": "Girls, Nudity and Critical Foot-In-Mouth Disease",
            "content_html": "<p>I've only barely watched <a href=\"http://www.hbo.com/girls/index.html\">Girls</a>, but it's clear from what I've seen of it that realistic, awkward sexuality is an important part of the show's DNA.</p>\n\n<p>Accordingly, when <a href=\"http://www.thewrap.com/judd-apatow-lena-dunham-get-mad-asking-shes-naked-much-girls/\">Tim Malloy from The Wrap discussed Lena Dunham's nudity</a> at a recent <a href=\"http://en.wikipedia.org/wiki/Television_Critics_Association\">Television Critics Association</a> panel for the show, he set off a miniature firestorm when he said he didn't \"get the purpose\" of all that clothes-free acting.</p>\n\n<p>Although I definitely don't want to add to the dog-pile that inevitably occurs when someone makes a faux pas that goes viral, I would like to discuss some aspects of Malloy's \"question\" that may help explain why this incident rubbed so many people the wrong way.<!-- more --></p>\n\n<p>To provide context, here is Malloy's quote, transcribed as part of the post above:</p>\n\n<blockquote>\n  <p>I don’t get the purpose of all the nudity on the show. By you particularly. I feel like I’m walking into a trap where you say no one complains about the nudity on ‘Game of Thrones,’ but I get why they’re doing it. They’re doing it to be salacious. To titillate people. And your character is often naked at random times for no reason.</p>\n</blockquote>\n\n<p>This immediately inspired rage-filled reactions from the combined panel of <a href=\"http://www.twitter.com/juddapatow\">Judd Apatow</a>, Jenni Konner and <a href=\"http://en.wikipedia.org/wiki/Lena_Dunham\">Lena Dunham</a>, and I think it's easy to see why.</p>\n\n<p>There are at least three things about this \"question\" that make it frustrating: In a forum designed for questions and answers, Malloy stood up and spoke his opinion instead of asking an actual question, leaving the panelists to respond to the first interpretation that came to mind. He talked about Dunham's nudity – a well-worn topic for as long as the show has been airing – in a way that implied he didn't find it titillating because she <em>in particular</em> was naked instead of someone else. Finally, he wrapped up by saying that sexual content was included in the show at \"random times for no reason,\" which implies the writers are careless and arbitrary about including nudity in the show.</p>\n\n<p>When Malloy discussed this further with Apatow, he was told that \"there's a way to word a question about the reason for nudity on the show and it was not done elegantly,\" which got me thinking. How could Malloy approach this topic to both clearly communicate his intent and avoid offense? For the sake of this post, I'm going to give him the benefit of the doubt and operate under the assumption that he didn't actually mean to personally insult Lena Dunham by implying that she shouldn't be naked so much.</p>\n\n<p>It's clear that Malloy feels that Girls has crossed the line into including nudity just for the sake of it. I think it's a fair criticism that <a href=\"http://www.hbo.com/\">HBO</a> oftentimes seems to include nudity in all their shows just because they can, and it's definitely possible that the freedom of paid cable would inspire show creators to include more nudity than is strictly necessary. If Dunham's nudity was surprising or funny the first few times it appeared in the show, does it still serve the same purpose after the newness has worn off?</p>\n\n<p>However, even if excessive nudity might be a fair criticism when leveled at HBO in general, in context it reads like Malloy's personal reaction to Girls and Lena Dunham in particular. Accordingly, rather than flatly stating what he thought, he should have phrased his question in a way that it might cause the panelists to consider that possibility and address it.</p>\n\n<p>Here's how I might have phrased this question more effectively:</p>\n\n<blockquote>\n  <p>Nudity and sex have been a big part of Girls from the beginning, oftentimes presented in an unglamorous, realistic way. Do you think that those moments will always be a big part of the show, and if so, how do you avoid including them just for the sake of it?</p>\n</blockquote>\n\n<p>Two important things here: this is actually a question, and my opinion never comes into it. I'm not telling the panelists what I think, but I am leading them to a possible conclusion. I'd bet you anything that if Malloy had done those two things, his question would have sailed right on through without further comment.</p>\n\n",
			"image": "https://unsquare.com/images/lena-dunham-feature.gif",
            "url": "https://unsquare.com/blog/girls-nudity-critical-foot-mouth-disease/",
            "date_published": "2014-01-13 00:00:00 -0800"
        },

        {
            "id": "/blog/watch-your-fucking-mouth",
            "title": "Watch Your Fucking Mouth",
            "content_html": "<p>I've been reading a lot of unproduced screenplays recently, and a few things have been jumping out at me.</p>\n\n<p>First off: a lot of writers fumble on structure. A lot of what I've read has shown clear signs of competence but wandered around plotless for upwards of fifty pages. Some writers can pull off plotless, but most of them are novelists.</p>\n\n<p>The other thing I've noticed is that a lot of writers are really bad at swearing.<!-- more --> I'll read a script full of characters saying fuck every other sentence and it just rings untrue. I always feel a bit silly when I ding a script for “too much swearing”, so I've been trying to put my finger on what bothers me about it. I'm no prude, and some of my favorite scenes and movies are full of swearing, so what's different about these scripts?</p>\n\n<p>I think the key difference is that these writers are swearing by default. They probably swear a decent amount in their own lives, they've watched plenty of movies full of swearing, so they throw in swearing because that's how people sound, right? The problem is that they forget to make their choice of words about the characters saying them. The swearing is about the writer, not the characters.</p>\n\n<p>People who accuse writers of laziness when they use vulgarity are missing the point. Swearwords aren't automatically lazy; it all comes down to how you use them. Some of the greatest scenes in film and TV revolve around characters who swear up a blue streak, but they work because those moments reveal something about those characters and deepen our understanding of their feelings and motivations.</p>\n\n<p>Here are a few of my favorite examples:</p>\n\n<p>1) Steve Martin blows up at a rental car agent in Planes, Trains and Automobiles.</p>\n\n<div class=\"video\"><figure><iframe width=\"640\" height=\"480\" src=\"//www.youtube.com/embed/nWRxPDhd3d0\" frameborder=\"0\" allowfullscreen=\"\"></iframe></figure></div>\n\n<p>Up until this point the character has been mild-mannered and relatively patient, but he's been through such an ordeal that he finally snaps and lets loose in the way only a man on the edge would do. The way he swears also tells us something about him as a character; it's like a dam bursting, this sudden barrage of profanity pours forth from him and he's punctuating every fucking word of every fucking sentence with another fucking swear word.</p>\n\n<p>2) Peter Capaldi (the next Doctor Who!) in pretty much every scene of In The Loop.</p>\n\n<div class=\"video\"><figure><iframe width=\"640\" height=\"480\" src=\"//www.youtube.com/embed/cIPxLzfw6wU\" frameborder=\"0\" allowfullscreen=\"\"></iframe></figure></div>\n\n<p>Malcolm Tucker swears constantly and with evident relish. He terrorizes everyone around him and uses words like knives. He isn't content with throwing out a “fuck” here and there, he rants and raves and spins absurd metaphors and embellishes every sentence with an acidity that jumps out of the screen at you.</p>\n\n<p>3) Alec Baldwin in Glengarry Glen Ross.</p>\n\n<div class=\"video\"><figure><iframe width=\"640\" height=\"480\" src=\"//www.youtube.com/embed/elrnAl6ygeM\" frameborder=\"0\" allowfullscreen=\"\"></iframe></figure></div>\n\n<p>David Mamet wrote this scene for Alec Baldwin. It isn't in the stage play, but it's by far the most famous moment in the movie. Baldwin is in the zone here, he's all rhythm and rancor and cool energy. He swears for emphasis, to make a point, to hammer home his message and it flows like poetry. Say what you will about Mamet the man, but when he could write, he could write.</p>\n\n<p>4) Bunk and McNulty in The Wire.</p>\n\n<div class=\"video\"><figure><iframe width=\"640\" height=\"480\" src=\"//www.youtube.com/embed/SO0WW2QXIYc\" frameborder=\"0\" allowfullscreen=\"\"></iframe></figure></div>\n\n<p>Two characters communicate entirely through the word fuck and it's hilarious. They give every variation of the word its own meaning. A large part of this relies on the talent of the actors and their delivery, but the humor is there in the writing. The great part about this scene is that it shows us that the characters know each other so well that they can communicate with only one word.</p>\n\n<p>These are all excellent examples of writers using profanity to tell us something about their characters. Swearwords are words like any others; they have a certain bite and relish to them, but if they are used poorly, they clang and fall flat just like any other.</p>\n\n<p>So, what's the takeaway? Should writers avoid profanity in their scripts? Maybe, maybe not. Maybe they really just need to hear their words read aloud. I feel like a lot of the problems with dialogue become glaringly obvious when the words are read aloud. Mainly, though, it's a matter of deciding <em>why</em> a character swears and <em>how</em> they swear.</p>\n",
			"image": "https://unsquare.com/images/deadwood-feature.gif",
            "url": "https://unsquare.com/blog/watch-your-fucking-mouth/",
            "date_published": "2013-08-18 00:00:00 -0700"
        },

        {
            "id": "/blog/see-you-next-tuesday-how-and-why-the-onion-crossed-the-line",
            "title": "See You Next Tuesday: How and Why The Onion Crossed the Line",
            "content_html": "<p><img src=\"https://unsquare.com/images/onion-logo.jpg\" alt=\"The Onion Logo\" class=\"image-left\" /></p>\n\n<p>The 2013 Academy Awards ceremony was last night, February 24th, and critics both amateur and professional are weighing in with various post-ceremony reactions. There weren't any huge upsets – Argo won Best Picture, as the buzz had predicted – and most commentators agree that Seth McFarlane relied on too much crass humor and approached the ceremony as if it was a roast instead of a celebration.</p>\n\n<p>However, the most lingering controversy originated from outside the event, when The Onion's Twitter account tweeted (and later deleted) <a href=\"http://www.hollywoodreporter.com/news/onion-calls-quvenzhane-wallis-c-424113\">a joke that referred to nine-year-old Quvenzhané Wallis as a \"c—\"</a>.</p>\n\n<p>The Onion quickly posted an <a href=\"http://www.theonion.com/articles/the-onion-apologizes,31434/\">out-of-character apology from their CEO</a> first thing this morning, but memories are long on the internet, and there are some people who will never forgive them for this incident.</p>\n\n<p>The interesting thing is that The Onion has a long history of posting edgy satire, but as far as I know, this is the only time they've ever chosen to publicly apologize for one of their jokes missing the mark.<!-- more --></p>\n\n<p>I definitely agree with their decision to remove the tweet and apologize; it was thoroughly tone-deaf and completely unfunny. However, I think it's interesting to consider why that joke didn't work when compared to other equally controversial pieces on the site. For example, earlier in the night they used the <a href=\"https://twitter.com/TheOnion/status/305849741000994817\">n-word in a joke about Quentin Tarantino</a> and it seems to have passed unnoticed.</p>\n\n<p>First off, the most obvious problem with the tweet is that it places a nine-year-old girl at the center of harsh satire. Even if it wasn't the author's intent, it was far too easy to read the tweet as a genuine attack on a child, which is not something that most people are willing to overlook. However, I also think it's notable that the tweet's style didn't match The Onion's normal editorial voice. It was written in a casual, off-the-cuff \"live-blog\" style and was followed by tweets structured more like their signature \"Area Man\" format.</p>\n\n<p>Part of what makes The Onion work so well is the way they juxtapose a distanced, impersonal editorial style with shocking satire. One of the best pieces I've seen on the site recently, <a href=\"http://www.theonion.com/articles/teenage-girl-blossoming-into-beautiful-object,31061/\">Teenage Girl Blossoming Into Beautiful Object</a>, is also one of the most chilling things I've ever read because it rings so horribly true. That article is satire on the level of Jonathan Swift, where the correct response is horror, not laughter.</p>\n\n<p>The Onion's comedy works largely on the understanding that they are almost always saying the exact opposite of what they believe; in rare cases, such as their stunning, pitch-perfect <a href=\"http://www.theonion.com/articles/fuck-everything-nation-reports,30743/\">response to the Newtown massacre</a>, they put less ironic distance between the article and its true intent, but those pieces are still presented as fake journalism or simulated editorials.</p>\n\n<p>That distance is part of what makes it understood that the target of their satire isn't necessarily the apparent subject of their posts. Along those lines, I'd imagine that the target of the tasteless joke about Miss Wallis was actually the sort of person who would say horrendous things about a nine-year-old actress excited about being at a massive awards ceremony. (For examples, check out the first few comments on <a href=\"http://jezebel.com/5986598/the-only-oscar-gif-you-need-starring-quvenzhane-wallis\">this Jezebel post</a>.) The problem was all about the joke's presentation and, most crucially, word choice. Instead of working as an anti-exemplary comment on the misogynist nit-picking that dominates award shows, the tweet read as a face-value takedown of a young actress.</p>\n\n<p>However, I'd argue that if the joke was presented in The Onion's editorial style, the intent would have been clearer and the joke might have received a more measured response. Imagine, for example, if the joke was written as one of their headlines or couched in a fake editorial. Of course, I doubt there's any way they could have worked in the c-word without coming off as grasping for shock value, and I think better jokes can be made. I do think there's a valid satirical target found in the occasionally poisonous discussions about Miss Wallis' nomination (or really, discussions of any actress), but the most important thing to make clear is that she is not that target.</p>\n\n",
			
            "url": "https://unsquare.com/blog/see-you-next-tuesday-how-and-why-the-onion-crossed-the-line/",
            "date_published": "2013-02-25 00:00:00 -0800"
        },

        {
            "id": "/blog/write-every-day-for-a-month-part-one-of-twelve",
            "title": "Write Every Day for a Month, Part One of Twelve",
            "content_html": "<p>Last year I bought a giant wall calendar that I used to track my writing habits. I used a green check to indicate days when I wrote, and red checks on days that I didn't. I bought the calendar a few months into the year, so one of the first things I did was put red checks through those months. This was not a good beginning.</p>\n\n<p>I ended up writing only intermittently, usually one or two days here and there followed by weeks of nothing. Lots of red Xs, easy to see from across the room. It didn't take long before I only updated the calendar occasionally, and usually only to add a bunch of red Xs. I did have success late in the year when I wrote a story and had it accepted for publication, but after that I struggled with all of my follow-up work, and pretty soon I stopped updating the calendar at all. It was clear that my system wasn't working.<!-- more --></p>\n\n<p>However, I still wanted to find some way to track my writing and inspire myself to keep doing it every day. I've been wracking my brain for years trying to figure out a way to apply my reading habits to other parts of my life. Finally it occurred to me that I shouldn't track days I didn't write because it was just demoralizing. Instead, I should only track my successful days.</p>\n\n<p>Luckily I had this brainstorm at the start of the month, just in time to begin a new goal and put myself on solid footing. I took a quick trip to Target and picked up a new calendar along with some stickers I would use to track my progress. You can see the results below.</p>\n\n<p><img src=\"https://unsquare.com/images/january-calendar.jpg\" alt=\"January 2013 Writing Calendar\" /></p>\n\n<p>I'm proud to say that I wrote <em>every day</em> in January of 2013.</p>\n\n<p>One of the things that was a huge help was the fact that I kept my criteria for writing very forgiving. I knew there would be days when writing would be the absolute last thing I'd want to do. Days when I'd be exhausted or put it off until the last minute. Usually both at once.</p>\n\n<p>Instead of forcing myself to work on Fiction Fit For Publication, I decided that any kind of writing would count towards my goal. That meant writing in a journal, free-writing, flash fiction, prose fragments, blog posts, anything that went on for more than a hundred words or so. At first I fell back on journaling or free-writing pretty often, but once I started getting into the swing of things, I found it much easier to blog regularly.</p>\n\n<p>I updated <a href=\"http://fullofwords.com\">Full of Words</a> the most, but I also wrote some pieces for <a href=\"http://gamersushi.com\">GamerSushi</a> that I'm pretty proud of. I quickly discovered that writing every day began to take away some of the specter of writing in general. Blogging was no longer quite so intimidating because I knew I could knock out a book review in under an hour if nothing else came to mind.</p>\n\n<p>Today I'm kicking off February by writing this post. My goal is to continue taking things easy. Sure, I want to start producing more fiction, but right now the important thing is writing every day no matter what. I have a feeling that the more I write, the more I'll want to write, and the easier it'll be to tackle something more ambitious.</p>\n\n<p>Until then, I have plenty of books to review.</p>\n\n",
			
            "url": "https://unsquare.com/blog/write-every-day-for-a-month-part-one-of-twelve/",
            "date_published": "2013-02-02 00:00:00 -0800"
        },

        {
            "id": "/blog/its-official-im-hooked-on-pc-gaming",
            "title": "It's Official: I'm Hooked on PC Gaming",
            "content_html": "<p><img src=\"https://unsquare.com/images/witcher2.jpg\" alt=\"The Witcher 2\" class=\"image-left\" /></p>\n\n<p>Last night I played <a href=\"http://www.gog.com/gamecard/the_witcher_2\">The Witcher 2</a> for several hours by accident.</p>\n\n<p>I'd just re-installed the game on my Mac Mini's Bootcamp partition after realizing that I could free up space by reformatting a spare external drive. I sat down at the computer to make sure everything was up to date and running properly and ended up getting sucked into the game.</p>\n\n<p>Freeing up disk space was actually kind of a huge deal because until recently I could either have The Witcher 2 installed (it takes up most of the partition with its 21gb install) or I could install a handful of games in Steam. When your hard drive is always about to run out of storage space it definitely puts a damper on things.</p>\n\n<p>Now, however, I have more than a dozen games installed – most of them purchased during the <a href=\"http://store.steampowered.com\">2012 Steam Winter Sale</a> – and I'm starting to get excited about the possibilities of PC gaming. The best part is that a significant number of the games I've bought recently are compatible with Macs and actually play quite well on my Macbook Air (even if it does tend to run hot and loud the entire time I'm playing).</p>\n\n<p>A number of factors have combined to pique my interest in PC (and Mac) gaming. Right now we're in a lull between AAA console game releases, so I'm already on the lookout for something new to play. However, I'm not really that excited about the inevitable next generation consoles. The Wii U landed with a thud, and I'm having a hard time believing that Sony and Microsoft are going to come up with anything particularly impressive, especially considering the fact that they're probably betting on Kinect and Move more than I'd like.</p>\n\n<p><img src=\"https://unsquare.com/images/dao.jpg\" alt=\"Dragon Age: Origins\" class=\"image-right\" /></p>\n\n<p>Additionally, it seems clear that digital distribution will become more and more prominent in future console generations. I find myself buying more and more digital content, and I could definitely foresee a future where I buy all of my games digitally.</p>\n\n<p>That said, what I really want to see on consoles is a business model similar to what Steam already delivers today – deep discounts and regular sales. Steam's pricing makes it more than competitive with both used games and piracy.</p>\n\n<p>Unfortunately, I have a feeling that Microsoft and Sony will never quite catch on to the Steam model, so why wait? Instead, why not hitch my wagon to Steam wholeheartedly and invest in a full-fledged gaming PC instead of a next-generation console? The initial investment will probably be slightly higher, but a well-built system should hopefully have more flexibility and longevity.</p>\n\n<p>I'm already impressed with the results I get running games on my current systems. I've played several hours of both <a href=\"http://www.amazon.com/Dragon-Age-Origins-Ultimate-Download/dp/B005709NXI\">Dragon Age: Origins</a> and <a href=\"http://www.gog.com/gamecard/the_witcher\">The Witcher</a> on the Air, and when I want to play a Windows-only game, I switch over to Bootcamp on the Mini (there is a Mac version of The Witcher 2, but it claims the Mini's specs aren't good enough). It only stands to reason that a dedicated gaming box would improve my results.</p>\n\n<p>I will admit that I am hesitant to pay full retail price ($59.99) for a digital game, but that might change over time, especially with a dedicated system. Until then, I can always just wait around for the next crazy sale on Steam.</p>\n\n",
			
            "url": "https://unsquare.com/blog/its-official-im-hooked-on-pc-gaming/",
            "date_published": "2013-01-03 00:00:00 -0800"
        },

        {
            "id": "/blog/ok-computer-an-autobiography",
            "title": "OK Computer: An Autobiography",
            "content_html": "<p><img src=\"https://unsquare.com/images/ok-computer-bw.gif\" alt=\"OK Computer B&amp;W\" class=\"image-left\" /></p>\n\n<p>Lately I've been thinking a lot about the passage of time, mostly because I just turned thirty and that is supposed to Mean Something.</p>\n\n<p>One thing that struck me recently is that this year marks the fifteenth anniversary of Radiohead's OK Computer, which is literally half a lifetime ago.</p>\n\n<p>I can't quite wrap my head around it.</p>\n\n<p>OK Computer was a complete revelation when I first heard it back in 1997. You could draw a line and separate my experiences with music into the years before and the years after I heard it.</p>\n\n<p>In the years before, I mostly listened to what I heard on the radio or on MTV. My dad had great taste in music, and I followed his cues. I listened to Casey Casum's Top 40 while mowing the lawn. I enjoyed music, but I never really thought about it that much.</p>\n\n<p>As I grew older, I started slowly branching out and defining my own taste. I made a GeoCities fan site for The Fountains of Wayne after their debut album was released. I distinctly remember buying Beck's Odelay and REM's New Adventures in Hi-Fi during a trip to Borders. I heard Ben Folds Five late at night on the radio when I should have been asleep, tracked down a copy of Whatever And Ever Amen at the library and dubbed a copy to casette. On the opposite side of the casette I dubbed London Calling by The Clash. I starting watching 120 Minutes and reading record reviews. I listened to Pavement's first album, but didn't quite get it.</p>\n\n<p>OK Computer was different, though. After I bought it, I stuck it in my CD player and didn't take it out for six months. I listened to that album daily. Sometimes several times a day. Sometimes several times in a row. One time I sat in bed listening to it on repeat and fell asleep with my eyes open.</p>\n\n<p>No other album has ever grabbed me so thoroughly and refused to let go. I listened to that album until the CD was too scratched to play and I had to buy another. I was obsessed with Radiohead. I scoured CD bins for their singles and rarities, and no price was too high for a few tossed-off b-sides. I looked forward to nothing more than the premiere of the newest Radiohead music video.</p>\n\n<p>OK Computer marked my transition from music listener to music lover.</p>\n\n<p>Following Radiohead through all of their ups and downs only broadened and deepened my appreciation of music in general. Their experimentation led to my willingness to experiment and listen to genres of music I never thought I would enjoy. A few years after OK Computer came the advent of file sharing, and my musical tastes exploded in the face of so many options. It only got more eclectic from there.</p>\n\n<p>In fact, I feel certain that my fifteen-year-old self would find some of my current favorite bands unlistenable or bizarre.</p>\n\n<p>Of course, I sometimes wish I could go back to a time when an album could hold my attention for months at a time. Nowadays my attention span is much shorter. No album stays in rotation for very long. I've heard so much that it is rare when new music surprises me.</p>\n\n<p>I also no longer feel quite the same way about Radiohead. They've made some fantastic music since OK Computer, but they've also made some terrible music, and it's clear they had a hard time following up what is generally considered their masterpiece. To be honest, I rarely listen to them now.</p>\n\n<p>Even still, I feel certain that I will always have a deeply personal connection to OK Computer. Maybe someday I'll find another piece of music that means as much to me.</p>\n\n<p>I won't be holding my breath, though.</p>\n\n<p>For now I think I'll focus on trying not to think about how old I will be when the 25th anniversary rolls around.</p>\n",
			
            "url": "https://unsquare.com/blog/ok-computer-an-autobiography/",
            "date_published": "2012-05-25 00:00:00 -0700"
        },

        {
            "id": "/blog/the-nature-of-a-good-plot-twist",
            "title": "The Nature of a Good Plot Twist",
            "content_html": "<p>I finished playing <a href=\"http://www.heavyrainps3.com\">Heavy Rain</a> last night, and it got me thinking about plot twists and their function in storytelling. Heavy Rain is a game that places itself firmly in the \"thriller movie\" genre, for better or worse.</p>\n\n<p>It's great at building tension and getting you to care about the characters you meet and control, but it falls into the trap that undermines so many thrillers, namely that its endgame centers around a \"shocking\" reveal that doesn't actually make any logical sense.</p>\n\n<p>(Just a quick warning: this rest of this post will contain spoilers about movies that are old enough I will assume everyone has seen them. There will be no Heavy Rain spoilers, however.)</p>\n\n<p>The problem with plot twists, see, is that by nature they should make you jump out of your seat or gasp in horror. You'd never expect that [CHARACTER NAME] was the killer in Heavy Rain, after all, and you are of course horrified that you empathized with the character while playing. That's the root of the problem, though; in order to make the twist ending truly surprising, the game's writers decided to fill the story with red herrings and give no real concrete clues about the real killer's identity. They didn't want you to figure it out ahead of time, after all.</p>\n\n<p>I think this is why very few storytellers can pull off a truly stunning twist that holds up under scrutiny. If a writer works to make her story internally consistent, she may layer in too many readable clues and people will write off the twist as \"predictable\" and feel cheated. The easiest shortcut to making a completely unpredictable twist, then, is to make that twist completely illogical or at odds with everything leading up to it. This will at least ensure a visceral shock in the moment, but ultimately… the audience just feel cheated in the light of day. Six of one, half dozen of the other.</p>\n\n<p>There are the occasional successful twists, of course: The Sixth Sense, Fight Club, and The Usual Suspects come to mind. From what I can remember of the first two, clues to predict the twist were layered in throughout both movies. If you go back and re-watch them a second time, knowing the twist reveals the story rather than undermining it. Of course, there may be those of you out there who figured out the twists halfway through because of the clues.</p>\n\n<p>The Usual Suspects treads in kind of dangerous territory, however, in that its twist ending makes you question why everything you just watched even matters. If the entire movie is a lie told by Kevin Spacey's character, why should I even care what happened? I think what helps Usual Suspects is that it is such a well-made movie we forgive it for playing with such a hackneyed trope. It's rare that \"it was all just a dream!\" is used as anything but a cheap gag.</p>\n\n<p>I think the best twists are often so subtle you may not even realize they are there. I would argue that Minority Report has a twist ending, for example, although everyone who saw it with me disagreed with my perspective. My argument was that when Tom Cruise's character is arrested and put into cold storage, everything that happens after that is a dream, thus explaining why he is rescued and everything works out positively for the characters. The end of the movie doesn't pull back the curtain and reveal this, however, so it is entirely up for interpretation. The only clues you are given are a few lines from the jailer character about whether his charges dream while they are in storage.</p>\n\n<p>In any case, I'd love to play another game in the style of Heavy Rain, if only the makers could be convinced to forego the showy twists of thriller movies and focus on things like character development and an internally consistent story. Surely there is a way to work in shocking reveals without causing massive inconsistencies and plot holes.</p>\n\n",
			"image": "https://unsquare.com/images/heavy-rain-feature.jpg",
            "url": "https://unsquare.com/blog/the-nature-of-a-good-plot-twist/",
            "date_published": "2010-03-13 00:00:00 -0800"
        },

        {
            "id": "/blog/books-of-the-future",
            "title": "Books of The Future!",
            "content_html": "<p>Just got caught up reading a very lengthy (and contentious) comment thread over at <a href=\"http://nielsenhayden.com/makinglight/archives/012168.html\">Making Light</a> regarding Amazon vs. Macmillan and eBooks in general, and it got me thinking. One of the commenters puts forth the idea that eBooks are the ultimate future of reading, and that those silly old things made out of paper will disappear into history shortly enough once eReaders make it big.</p>\n\n<p>I see a couple of problems with this. First off, the 250 unread books currently looming on my bookshelves beg to differ. They sure aren't going anywhere anytime soon. Same with the millions of books in new and used book stores and libraries. The commenter theorizes that non-electronic books are going to become collector's items for folks (like me) who just can't let go of physical books and want to live in the past.</p>\n\n<p>The problem with this, though, is that the argument is completely backwards. eReaders are the luxury item. The people who are most interested in eReaders are people who read a LOT because they see the attraction of carrying around 100s of books in their pockets and also because they think they can justify the sticker price. I definitely know that if I took the plunge and dropped several hundred dollars on an eReader any time soon that I'd feel the need to buy all my new books on that platform to justify the cost.</p>\n\n<p>Of course, it seems to me that I'm a rarity in that I think I could read enough to justify spending that much. I bet most people wouldn't see the attraction. Why spend several hundred dollars on an eReader when you can just go to a used book store and pick up a beaten-up paperback for $3 or run over to the library and spend nothing at all? That definitely makes wayyyy more sense for the folks who only read half a dozen books a year, tops.</p>\n\n<p>No, the way I see it, eReaders are more like blu-ray than anything else – and I say that as someone who owns and loves his blu-ray player. Blu-rays are a luxury. $5 bargain bin DVDs from Wal-mart are surely more than good enough for 9 out of 10 people, even those who have 42-inch HDTVs. Hell, there are probably still people out there making regular use of their VCRs – it would not surprise me in the least. eReaders are for the folks who care about having the most they can possibly get out of a piece of technology and who are willing to drop several hundred dollars to get it.</p>\n\n<p>(One odd point the commenter also tries to make is that people don't really care about typesetting or design, but it seems like the people who pay so much for a reading experience would be the ones most likely to care about how something is presented, no?)</p>\n\n<p>My theory (that I have just come up with this morning) is that eReaders will only become ubiquitous when they are either free or so cheap that you could lose one on a camping trip and not worry about it. Or spill an entire cup of coffee on and keep using (definitely a case where printed books are still the winner). Once it is no longer a big deal to replace your broken eReader, then it'll be believable that someone who only reads the new Stephanie Plum novels when they come out would consider picking one up. We may very well eventually get to that point, but I think it'll take a lot to get there, and there are some things that physical books will always do better.</p>\n\n<p>For example, there will always be people like me, who love the feel and smell of a good book in your hands while you read it, who <a href=\"http://faceoutbooks.com/\">obsess about cover art design</a> and love books as pieces of art that you can experience. I also love the fact that I can loan my books to friends or walk into a used book store and sell them back. It may be possible that someday you will be able to do almost all of those things with eBooks, but it seems like things we take for granted when it comes to physical media are prevented by DRM or considered piracy when it comes to digital media.</p>\n\n<p>I any case, I may someday look back at this post and laugh while I clutch an iPad crammed full of 1000s of books, but I doubt it. I have no plans to buy one at this time. I'm open to receiving it as a gift, though… nudge nudge wink wink!</p>\n\n<p>P.S. I almost forgot to mention – it seems like the folks espousing eBooks the most also think they'll mean a future where self-publishing is the norm. These people are certifiably insane. I want proofreading and copyediting, and I want someone to tell the jackass who thinks he wrote the Great American Novel that no, it's actually a complete piece of shit that nobody wants to read. No creative work should be made in a vacuum.</p>\n\n",
			"image": "https://unsquare.com/images/kindling-feature.jpg",
            "url": "https://unsquare.com/blog/books-of-the-future/",
            "date_published": "2010-02-06 00:00:00 -0800"
        },

        {
            "id": "/blog/jenny-lewis-vs-rilo-kiley",
            "title": "Jenny Lewis vs. Rilo Kiley",
            "content_html": "<p><img src=\"https://unsquare.com/images/jenny-lewis-rilo-kiley.jpg\" alt=\"Jenny Lewis vs. Rilo Kiley\" class=\"image-left\" /></p>\n\n<p>A bit of background: although I enjoy Rilo Kiley's music, I've never been a huge fan. They are a nice little indie band that does quirk and usually does it fairly well. I have several of their albums, but I haven't listened to them much recently.</p>\n\n<p>The first time I heard their most recent album, \"<a href=\"http://en.wikipedia.org/wiki/Under_The_Blacklight\">Under the Blacklight</a>\", I was turned off pretty quickly and ended up deleting it from my hard drive. From that first impression, it seemed clear that they had decided to jettison everything intimate and quirky about their sound in an effort to make it big in the mainstream, and I found the results lacking.</p>\n\n<p>As for Jenny Lewis, I enjoyed <a href=\"http://en.wikipedia.org/wiki/Rabbit_Fur_Coat\">her first album under her own name</a>, thought it was a nice change of pace, but, again, I didn't think it was anything earth-shattering. It seemed more like Neko Case-lite with a girl group spin. It's one of those albums that I appreciate but never listened to that much or that often. However, when her second album, \"<a href=\"http://en.wikipedia.org/wiki/Acid_Tongue\">Acid Tongue</a>\", came out, I listened to a few samples and was immediately hooked. I bought it pretty promptly and it's not only in heavy rotation, it's easily one of my most favorite albums of the year.</p>\n\n<p>After listening to Acid Tongue a few dozen times, I started wondering if I had written off Under the Blacklight unfairly, so I decided to give it another spin and see if there were any hidden gems I missed the first time around. To make a long story short, there are definitely some pretty amazing songs on the album, but they're the exception to the rule. Although my first impression was harsh, it wasn't too far off base.</p>\n\n<!-- more -->\n\n<p>The best song on the album is <a href=\"http://itunes.apple.com/WebObjects/MZStore.woa/wa/viewAlbum?i=261661266&amp;id=261661212&amp;s=143441\">Close Call</a>, the second track. It's got a good hook and a really catchy chorus. Even though it isn't that stylistically different from the rest of the album, its one of the few places where the different elements the band is working with here actually gel into a cohesive whole. I also like the first track, Silver Lining, even though it sounds like a Jenny Lewis solo song fighting to get out of a traditional Rilo Kiley arrangement.</p>\n\n<p>The most consistent stylistic elements throughout the album are robotic drums (drum machines or otherwise), new-wave synths and a band taking itself way too seriously. Interestingly enough, the robotic drums and new wave synths have always been a big part of their sound, but in their earlier work it sounded more like a teenage girl recording cynical ballads in her bedroom with a drum machine. Not in a bad way, mind you, but the songs sounded smaller, more intimate and less self-consciously \"mature\". Lyrically, the subjects were far more mundane and/or knowingly quirky. They had the new-wave style without turning into something inorganic.</p>\n\n<p>Almost the entire first half of their newest album seems to be trying to prove that they are, in fact, a serious band ready for the big leagues. Mostly, they just sound like they need to relax. Most of the songs have a chilly, distant atmosphere, which works well in small doses (Close Call), but just seems overwrought after four or five tracks. There's a crucial point in the album about 6 songs in where I've wanted to turn it off almost every time. When I'm in an album-listening mood, I don't like skipping tracks, so if a song gets on my nerves, I'm more likely to never hear the rest of the album after that. Today I made myself keep listening, and I have to admit that the album continued getting on my nerves.</p>\n\n<p>It's kind of amazing how stark the difference is between Lewis' solo stuff and her work with the band. Where Rilo Kiley has become more inorganic and stilted, Lewis' second solo album feels organic, warm, lived in and vibrant. Apparently the recordings were all perfected on tour and recorded live, and it shows. Ironically, Lewis is more cohesive with the rotating cast of characters serving as her solo bandmates than she is with her ostensible mainstream gig.</p>\n\n<p>Solo albums are kind of a strange animal. They're oftentimes nothing more than experimental detours or egotistical failures. It's a rare case where a solo album is this much better than an artist's work with their actual band. Considering how much her solo work has grown by leaps and bounds, I would be very surprised if Rilo Kiley has another album in them. At this point, they're doing nothing more than holding her back.</p>\n\n<p><a href=\"https://www.youtube.com/user/jennylewismusic\">Jenny Lewis on YouTube</a></p>\n\n",
			
            "url": "https://unsquare.com/blog/jenny-lewis-vs-rilo-kiley/",
            "date_published": "2008-11-13 00:00:00 -0800"
        },

        {
            "id": "/blog/the-lost-legacy-of-heroes",
            "title": "The Lost Legacy of Heroes",
            "content_html": "<p>Heroes continues to occupy my mind this week. I think that's another good sign that it's a show worth watching. The shows that I end up removing from my recording schedule are the ones that I don't care about, that I don't miss when they're gone.</p>\n\n<p>Heroes, lurching monster that is is, is still compelling enough that it keeps me rehashing its convoluted story-lines around the metaphorical water-cooler we call the internet.</p>\n\n<p>Accordingly, something that has been occupying my mind this week is the giant influence that Lost has had on network TV in general and Heroes in particular. Heroes is one of several shows that were created in the wake of the initial huge (and unexpected) success of Lost. Suddenly every network had its own ensemble show with complex story-lines, flashbacks, and the occasional hint of science-fictional doings. Most of these shows disappeared fairly quickly.</p>\n\n<p>Off the top of my head, I'm pretty sure that Heroes is the only \"post-Lost\" show still on the air. I qualify it as a \"post-Lost\" show simply because its debt to Lost is right out there, front-and-center. However, rather than outgrowing its debts and influences over time and coming into its own, Heroes seems to be slowly collapsing under the weight of its creative debts. There are a few aspects of the show that seem particularly drawn from Lost, for better or worse, and I'll break them down after the jump.</p>\n\n<!-- more -->\n\n<h3 id=\"1-a-large-ensemble-cast\">1) A large ensemble cast.</h3>\n\n<p>Of all the story elements I'm going to discuss here, I think this aspect is the one that arguably works the best for the material. It makes sense that you would need a decent-sized cast of characters if your story is going to focus on competing sides in a battle between \"heroes\" and \"villains\" bent on saving or destroying the world, as appropriate. Where I think Heroes went wrong is that they also appropriated Lost's habit of constantly adding and removing characters from the cast. If the show had spent more time focusing on the core cast of characters instead of trying to constantly re-shape the ensemble, I think it would be on much firmer footing right now. Basically, imagine what the show might have been like if Robert Altman had gotten his hands on it when he was at the peak of his powers.</p>\n\n<h3 id=\"2-character-deaths\">2) Character deaths.</h3>\n\n<p>This one ties pretty closely into #1. Part of what makes Lost's revolving-door cast work so well is that they don't hesitate to kill characters off for dramatic effect. Even when new characters are added to the cast, you can expect one or two of the long-timers to head right on out the door before too long. Fan favorite characters are not exempt from the toll of death on Lost, and there's no guarantee that characters like Jack, Kate, and Sawyer will manage to live until the series finale. It adds incredible tension to the show, and it's understandable that other producers would want to match that same level of intensity.</p>\n\n<p>Unfortunately, the Heroes writers have completely missed the point of this particular plot device. With very few exceptions, no-one on Heroes ever really dies. I've lost count of the number of times that one of the main characters has \"died\" only to be revived or saved in some fashion. More than one of the characters on the show has powers that make them basically invincible and completely safe from death. It sucks the tension right out of every situation. It also means that there's nothing to balance out the new additions. Very few genuine deaths to write characters off the show completely.</p>\n\n<p>It'd work much better if Heroes stopped \"killing\" characters unless the death is actually going to stick. We as audience members no longer believe them when they tell us that someone is dead, even when they are shot multiple times. This might be one reason why a recent character's death involved a graphic decapitation… no coming back from that one, hmm? It's clear that the writers don't <em>really</em> want to kill characters like Peter or Sylar, but the least they could do is stop faking us out and reminding us of their insincerity.</p>\n\n<h3 id=\"3-flash-backs-and-flash-forwards\">3) Flash-backs and flash-forwards.</h3>\n\n<p>Heroes and Lost both rely pretty heavily on flashbacks and flashforwards. To give the Heroes writers a bit of credit, they did try to make this plot element their own by introducing actual time travel as a regular plot point instead of positioning all of the time jumps as \"things that have already happened\". Unfortunately, much like many aspects of Heroes, this plot device has become a crutch. To make matters worse, the writers never seem to do the due diligence to make these jumps in time internally consistent.</p>\n\n<p>Every time Peter or Hiro travel to the future, they see a new, wildly different apocalypse. It strains believability to the point that you no longer take these predictions seriously, simply because we know the world of the show will never get as bad as the characters think it will. So far, the writers don't seem to have the chutzpah necessary to make a change of that magnitude actually stick (See: character deaths).</p>\n\n<p>Flashbacks are nearly as problematic, simply because the show is still correcting course after season two was shortened due to the writer's strike. In the most recent flashback episode, most of the scenes felt more like <a href=\"http://en.wikipedia.org/wiki/Retcon\">retcons</a> as opposed to genuine moments of remembered past that were only now uncovered. I'm willing to believe that the Lost writers have at least a rough plan for most of their major story beats, but I get the impression that the Heroes writers are making it up as they go along to a much greater degree.</p>\n\n<p>In conclusion, I hope that Heroes stays on the air long enough to fight its way through its current identity crisis. Although I don't think the writers need to remove all traces of Lost from their story engine, I do think that they should re-evaluate their more common plot devices to determine whether or not they are essential to the identity of Heroes as a show, or simply functioning as crutches that promote lazy writing. All they really need to do is find a good, solid Clark Kent for their schizophrenic Superman.</p>\n\n",
			"image": "https://unsquare.com/images/heroes-feature.jpg",
            "url": "https://unsquare.com/blog/the-lost-legacy-of-heroes/",
            "date_published": "2008-11-12 00:00:00 -0800"
        },

        {
            "id": "/blog/who-watches-the-watchmen-definitely-not-the-heroes-writers",
            "title": "Who watches The Watchmen? Definitely not the Heroes writers.",
            "content_html": "<p>First off: a disclaimer. I'm going to discuss this week's Heroes episode in my post, so if you're spoiler averse, please stop reading now.</p>\n\n<p>With that out of the way, I think those of us who are current on the newest season of Heroes can all safely agree that the show is a complete mess. By the same token, I think if you <em>are</em> current on the show, it's because there's still something about it that keeps you hooked and ready for the next episode. It's almost as if it has some kind of charisma that makes you want to forgive its plot-holes and serious lapses in writing.</p>\n\n<p>It's why I keep watching, and keep hoping that the writing will rise above the current level and the writers will avoid any serious lapses in logic or character motivation. I have a feeling I will continue to get my hopes up only to have them dashed yet again.</p>\n\n<p>This week's episode, \"Villains\", was a particularly good example. It focused entirely on a flashback seen through the eyes of a \"dream-walking\" Hiro. It was nice to have an episode that centered on characterization as opposed to express-train \"save the world\" plotlines, but at the same time it only introduced more serious logical lapses to an already overstuffed storyline.</p>\n\n<p>Considering how this season has been received in the press and by fans, this episode felt like a last-ditch effort to remind the folks at home about the good times from season one. A number of familiar plot points from the first season were revisited and fleshed out from new perspectives. For the most part these details weren't much more than filler, but one storyline did at least have an interesting premise, namely that Sylar's descent into murder and mayhem wasn't entirely his own doing.</p>\n\n<p>Essentially the roles are reversed here, with Noah Bennett as the manipulative Company man (\"villain\") who wants Sylar to keep killing so that they can study him, and Sylar as the relative innocent (\"hero\") who truly regrets his initial act of violence and tries to commit suicide out of guilt. Sylar is a fascinating character, and I do like seeing more of his backstory, but I do wish that it didn't have to come at the cost of the imposing air of menace he cultivated throughout seasons one and two. That isn't my biggest problem with this storyline, however; my real issue is with the involvement of Kristen Bell's character, Elle.</p>\n\n<p>In this flashback storyline, we are told that Bennet and Elle partnered together to study Sylar. Elle was sent in undercover to draw him out of his shell by befriending him. She has second thoughts, however, and begins to have sympathy for Sylar as they become close, and she asks Bennett to back off.</p>\n\n<p>The big disconnect is that when we meet Elle for the first time in season two, she is a daddy's girl and an immature mess, completely sheltered and reliant on The Company for everything. In her scenes here, she seems much more in-control and mature, not to mention moral. In addition to that complete change in character, there are scenes later in season two where Elle saves several characters from a rampaging Sylar. I don't have the episode in front of me to watch, but from what I remember there wasn't even a hint of a shared history when they confronted each other.</p>\n\n<p>You could, perhaps, explain some of this away as a case of a serious mind-wipe or manipulation performed on Elle so that she doesn't remember what happened with Sylar, but that seems like a lazy explanation for what is, on the whole, half-assed writing. This particular storyline felt like it had some potential to be interesting, but it barely stands up to any kind of scrutiny. Overall, this week's episode amounted to nothing more than plotholes interrupted by filler.</p>\n\n<p>In conclusion, I think Heroes is best appreciated when you don't analyze it too closely. I liked this week's episode a lot more when I first started writing this post, and my opinion seriously went downhill from there. Doesn't mean I'm going to stop watching, though. Shameful, really…</p>\n",
			"image": "https://unsquare.com/images/elle-spark-feature.jpg",
            "url": "https://unsquare.com/blog/who-watches-the-watchmen-definitely-not-the-heroes-writers/",
            "date_published": "2008-11-10 00:00:00 -0800"
        },

        {
            "id": "/blog/inexplicable-cover-redesigns",
            "title": "Inexplicable Cover Redesigns",
            "content_html": "<p>I'm continually fascinated by the process of book cover designs and redesigns. I actually follow several blogs that focus on nothing but the subject of new book cover designs, often comparing hardback to paperback and US to UK or international versions. It's really interesting how books are sold in completely different ways in different countries. Re-released versions are also alternately fascinating and disappointing, depending on the thinking behind the updated version. Here's a good example:</p>\n\n<p><img src=\"https://unsquare.com/images/diamond-old-vs-new.jpg\" alt=\"The Diamond Age, Old vs. New\" /></p>\n\n<p>On the left is an earlier cover for <a href=\"http://en.wikipedia.org/wiki/The_Diamond_Age\">The Diamond Age</a> by <a href=\"http://en.wikipedia.org/wiki/Neal_Stephenson\">Neal Stephenson</a>. The cover on the right is for a version re-released this year to coincide with Stephenson's upcoming book, <a href=\"http://en.wikipedia.org/wiki/Anathem\">Anathem</a>. For some reason all of Stephenson's books (except for the <a href=\"http://en.wikipedia.org/wiki/The_Baroque_Cycle_(novel)\">Baroque Cycle</a>) are being re-released with covers that match the style of Anathem: a shadowy figure, lit from behind and walking or running through a doorway at the end of a long hall or large space.</p>\n\n<p>It's kind of bizarre, especially since the new cover makes The Diamond Age look more like a Jason Bourne book than a post-cyberpunk / steampunk / fantasy novel about a girl and the virtual world that exists in her diary. The old cover may be a bit dated and \"of its time\", but I think it does a much better job of communicating what the book is actually about, with its juxtaposition of rusty gears and amorphous 3D imagery.</p>\n\n<p>If you're interested in checking out a few good blogs focusing on book cover designs, here's my reading list:</p>\n\n<ol>\n  <li><a href=\"http://nytimesbooks.blogspot.com/\">The Book Design Review</a></li>\n  <li><a href=\"http://henryseneyee.blogspot.com/\">…by Henry Sene Yee Design</a></li>\n  <li><a href=\"http://bookcoversanonymous.blogspot.com/\">Book Covers Anonymous</a></li>\n  <li><a href=\"http://causticcovercritic.blogspot.com/\">Caustic Cover Critic</a></li>\n</ol>\n\n",
			
            "url": "https://unsquare.com/blog/inexplicable-cover-redesigns/",
            "date_published": "2008-08-22 00:00:00 -0700"
        },

        {
            "id": "/blog/ghost-in-the-shell-2-innocence",
            "title": "Ghost in the Shell 2: Innocence",
            "content_html": "<p>I remember watching the first Ghost in the Shell movie and being confused and mildly disappointed. up until that point, my only exposure to anime was Akira, which – although it was confusing as well – seemed far more epic in scope. I remember wondering if there were that many full-length anime features that were <em>as good</em> as I thought Akira was, and for a few years, I didn't think so.</p>\n\n<p>I was, of course, wrong. there were a hell of a lot of really excellent full-length anime features out there, I just hadn't found them yet.</p>\n\n<p>Now, in my personal continuum of anime features, nothing will probably ever top Spirited Away. That would just be heresy; I'd say that and Akira are on equal footing in my realm.</p>\n\n<p>Ghost in the Shell 2 was quite a lot different from the first movie. The difference was all the more striking because I watched the trailers included on the disc, and saw a clip of the first movie – which now looks primitive and cartoony – and a bit of Stand Alone Complex, the TV series – cartoony still, but much more modern.</p>\n\n<p>This one was pretty goddamn confusing as well, but there was something about it that clicked a whole lot better for me. Innocence is not only far more epic than the first film, it is far more philosophical in scope, and the surrealistic quality that I love so much in a good anime has been ramped up much higher. There were parts of this movie that kind of gave me the heebie-jeebies, and I now consider it a sign of quality when something I watch can scare me a little bit in the right way (Firefly being another example – the third episode made my skin crawl a little bit).</p>\n\n<p>The only thing that wasn't cool about the movie – and this is quite the internet scandal – was that instead of including regular subtitles, a closed captioned track was the only English option offered. You'd get things like <strong>[singing in japanese]</strong> or <strong>[dog whimpers]</strong>, all of which were plastered right up front in huge white letters.</p>\n\n<p>I decided a few years ago that kung fu flicks and anime were the only sorts of foreign films where I didn't mind English dubbing. In both cases, it's so you can pay as much attention to the visuals as possible. I'd actually prefer it if Ghost in the Shell had an English dub, cause I know there was a good amount of stuff that I missed just because I was trying to frantically read the subtitles and watch all of the crazy shit going on at the same time.</p>\n",
			"image": "https://unsquare.com/images/gits-feature.jpg",
            "url": "https://unsquare.com/blog/ghost-in-the-shell-2-innocence/",
            "date_published": "2005-01-13 00:00:00 -0800"
        }

    ]
}